[
  {
    "commentText": "sooooooooooo.\n cute"
  },
  {
    "commentText": "1:16 \"PUMPKIN\""
  },
  {
    "commentText": "If it wasn't for the quills they'd be more popular than cats."
  },
  {
    "commentText": "Inflection, nuance?\nNoam Chomsky, can you interpret for us?\nWOW! \nThis woman and her good pal are \"doin' fine.\"\nGaia at her best..."
  },
  {
    "commentText": "You know me, the fighting freak Knuckles,\nAnd we're at Pumpkin Hill,\nYou ready?"
  },
  {
    "commentText": "is it wrong that I just laugh at his squeeking through the whole video..."
  },
  {
    "commentText": "Teddy is cute"
  },
  {
    "commentText": "I love the way you feel like if you just pay attention a little harder you can understand what he's saying. I love rodents. Most have such a cuteness about them and you can always see their intelligence."
  },
  {
    "commentText": "the pumpkins look like plastic o_O"
  },
  {
    "commentText": "Utterly STINKS with cuteness!"
  },
  {
    "commentText": "Chatty little critter  xo  5-d  Lmao  Love Him XO"
  },
  {
    "commentText": "gorgeous"
  },
  {
    "commentText": "I just want to point out that us Pumpkins have been at war with Porcupines since before humans petted them and offered us to them as treats. 😤 😡 😡"
  },
  {
    "commentText": "I didn't know they made noise! Omg! 😭"
  },
  {
    "commentText": "Thats so strange how the porupine taught her english."
  },
  {
    "commentText": "Please tell Teddy to pronounce his consonants....\nLOL\n\nThat little guy is a happy camper....\nYOU have given him a nice life."
  },
  {
    "commentText": "i heard he says  ooohh boyy.."
  },
  {
    "commentText": "Is this his actual voice? Cos I ACTUALLY heard 'Pumpkin' at 0:53\n\nCuteness exploded btw<3"
  },
  {
    "commentText": "I want one!!!"
  },
  {
    "commentText": "OMG!!! that noise!!! Too cute"
  },
  {
    "commentText": "awwww!!"
  },
  {
    "commentText": "He sounds very funny though."
  },
  {
    "commentText": "This is hilarious !"
  },
  {
    "commentText": "Aw what a cute little dog <3"
  },
  {
    "commentText": "Someone needs to add subtitles to this. Hilarious!"
  },
  {
    "commentText": "I've seen this video many times and yet every time I watch it I'm still delighted by this little guy."
  },
  {
    "commentText": "Can Teddy eat popcorn?"
  },
  {
    "commentText": "Adorable.....!"
  },
  {
    "commentText": "i didn't know porcupines made such cute noises?? excellent content"
  },
  {
    "commentText": "Here from twitter, from Pat Seymour!"
  },
  {
    "commentText": "YESSSSSS"
  },
  {
    "commentText": "I want a pet porcupine!"
  },
  {
    "commentText": "too cute.  i predict a SPIKE in views"
  },
  {
    "commentText": "I just really needed to see Teddy eat his pumpkin today."
  },
  {
    "commentText": "I literally watch this video everyday! Cuteness overboard <3"
  },
  {
    "commentText": "\"Good, good, good! Mine! Mine! Mine!"
  },
  {
    "commentText": "Teddy's like, \"Yo, this sh** is off the chain, son.\""
  },
  {
    "commentText": "is that really its voice?"
  },
  {
    "commentText": "Well that's just adorable"
  },
  {
    "commentText": "Aw he so cute"
  },
  {
    "commentText": "KAWAII!"
  },
  {
    "commentText": "He sounds like Cousin Itt!"
  },
  {
    "commentText": "That's exactly how I sound when I eat."
  },
  {
    "commentText": "he is ADORABLE!!!"
  },
  {
    "commentText": "Maybe this is where they got the idea for Cousin Itt. From a hedgehog."
  },
  {
    "commentText": "Anytime I'm having a sad day I watch these videos and I feel better. :) I adore his cute noises, omg!!!!"
  },
  {
    "commentText": "I just found this video and I am in love with this little guy. I never thought of it before, but now that I have seen Teddy I think Porcupines are adorable. I grew up with a family of Opossums in the barn at my father's place. They were so happy to see the treats we sat out for them."
  },
  {
    "commentText": "Cutest porcupine I ever saw and heard. I wish I could smoosh him. Lol"
  },
  {
    "commentText": "Pretty old. But it makes me wonder why people treat animals like shit."
  },
  {
    "commentText": "Holy cow, I never imagined a porcupine could be so dang cute!!!!!"
  },
  {
    "commentText": "1:28 \"Yum yum?\" \"Yeah!\""
  },
  {
    "commentText": "Sounds like a Banjo-Kazooie character talking."
  },
  {
    "commentText": "1:25 \"This is good\"\nIt freaking talks, I want one! XD"
  },
  {
    "commentText": "thank you for cheering me beyond measure with this darling little guy...the world is a beautiful place..so fascinating..."
  },
  {
    "commentText": "This is so darn cute that I shared it in e-mails and on Facebook."
  },
  {
    "commentText": "my god that is so cute! I love how hes responding to you like hes in normal conversation"
  },
  {
    "commentText": "So cute!"
  },
  {
    "commentText": "Is it just me, or does he sound like COUSIN IT from the original Adams Family show?!!  Wow!"
  },
  {
    "commentText": "#cute"
  },
  {
    "commentText": "and how is this related to bigfoot again....?"
  },
  {
    "commentText": "teddy is SOOO cute"
  },
  {
    "commentText": "Do all Porcupines chit chat like that?? So adorable."
  },
  {
    "commentText": "I. Can't keep watching this video!! I love him so much!!   If I'm having a bad day, all I have to do is watch Teddy eat his pumpkin and I'm cheered up!!!! WE LOVE YOU TEDDY!!! LOVE FROM CANADA!! Xxxxxxoooooo"
  },
  {
    "commentText": "DID HE JUST SAY PUMPKIN"
  },
  {
    "commentText": "cute"
  },
  {
    "commentText": "Very good video! I just became a subscriber of your channel. Please become our subscriber, too."
  },
  {
    "commentText": "2:30\n\"Pretty good stuff?\"\n\"Yeah!\""
  },
  {
    "commentText": "brilliant!"
  },
  {
    "commentText": "Awww,so cute"
  },
  {
    "commentText": "Really? This is the noise that porcupines make? I guess I never stuck around to find out :-)"
  },
  {
    "commentText": "how adorable!"
  },
  {
    "commentText": "Does he like to cuddle? ...I wanna cuddle-buddy."
  },
  {
    "commentText": "oh he's so happy! hahahaha..."
  },
  {
    "commentText": "I love how some of his vocalizations actually sound like English.\n\n0:54 \"I like it. I like it, like it, like it, like it!\""
  },
  {
    "commentText": "I'm feeling quite down tonight so I just had to watch Teddy Bear eating and his adorable talking.  He makes my day. Thanks for sharing such a beautiful animal."
  },
  {
    "commentText": "Yep. This is what I needed today. Thank you very much."
  },
  {
    "commentText": "My only regret in life is that I can not hug this North American porcupine.\nThis animal makes the cutest noises imaginable, WHY IS IT NOT DESIGNED FOR HUGS?!??!\nFate is cruel."
  },
  {
    "commentText": "sooooooo cute!!!!!!"
  },
  {
    "commentText": "Wow. I had no idea porcupines were so vocal."
  },
  {
    "commentText": "Teddy is adorable! I ❤️him!"
  },
  {
    "commentText": "I think he likes that pumpkin more than corn on the cob lol"
  },
  {
    "commentText": "I love you Teddy"
  },
  {
    "commentText": "Is that what they really sound like? If so I want one now."
  },
  {
    "commentText": "Totally did not expect the sound that came out of him, to come out of him.  O_O"
  },
  {
    "commentText": "Awwwwwwwwwww"
  },
  {
    "commentText": "THEY MAKE A SOUND? :O"
  },
  {
    "commentText": "Teddy bear looks like a huge hamster no offense but he/she is cute and makes cute sounds"
  },
  {
    "commentText": "Who knew they were so chatty?   Love it."
  },
  {
    "commentText": "MORE MORE MORE TEDDY VIDEOS PLEASE!!!!!!"
  },
  {
    "commentText": "Adorable!"
  },
  {
    "commentText": "It sounds like he is mostly saying back off with this camera BS and lemme eat this bloody pumpkin, its MINE!"
  },
  {
    "commentText": "At 1:24 Teddy says \"It was fun!\""
  },
  {
    "commentText": "Adorable AF ))))"
  },
  {
    "commentText": "He's making the cutest little noises"
  },
  {
    "commentText": "spiky doggo"
  },
  {
    "commentText": "p"
  },
  {
    "commentText": "How do you keep that as a pet? Not criticising, but the logistics? Can you permanently dequill them? Or what do you do to prevent a quilling? Just caution? Didn't realise they were so chatty."
  },
  {
    "commentText": "Oh My F*ng God!!!"
  },
  {
    "commentText": "HE TALKS❤️❤️❤️❤️"
  },
  {
    "commentText": "He is very different to what we have here in South Africa. Here they have very big black and white quills that have caused the death of many Lions that thought that the \"porkeys\" were an easy meal. \nOnly some clever Leopards seem to make a meal out of them, sometimes. \nThe little \"Hedge Hog\" is the cute but very rare animal here."
  },
  {
    "commentText": "Can you cuddle a porcupine?  I don't think I could resist!!"
  },
  {
    "commentText": "I noticed it's been awhile since the last post, is Teddy still with us??"
  },
  {
    "commentText": "Are we sure he's happy or trying to communicate an emotion at all?  Not saying he isn't, but I don't think we can just assume he is.  After all, it's not hard to imagine that  the sounds could be him telling anyone else to back off and not try to take his food."
  },
  {
    "commentText": "So cute 😂"
  },
  {
    "commentText": "Adorabale\n😆😆😆😆"
  },
  {
    "commentText": "He really does sound like he is trying to say \"pumpkin\"!"
  },
  {
    "commentText": "do they really make this noise? ill be monkey uncle!!!"
  },
  {
    "commentText": "do they really make this noise? ill be monkey uncle!!!"
  },
  {
    "commentText": "I want a porcupine"
  },
  {
    "commentText": "he makes the cutest noises!!!"
  },
  {
    "commentText": "Porcupine eating pumpkins.  Sounds like something you'd find in an ABC book LOL"
  },
  {
    "commentText": "OMGosh!  I will forever see porcupines in a new light.  Is Teddy Bear really making those sounds?  He sounds almost human."
  },
  {
    "commentText": "This is the best clip on youtube eveeeer ❤❤"
  },
  {
    "commentText": "i never knew they made that kinda noise 0.O"
  },
  {
    "commentText": "PRECIOUS NOISES"
  },
  {
    "commentText": "OMG! He's so adorable & makes healthy choices too."
  },
  {
    "commentText": "Cousin It!"
  },
  {
    "commentText": "Is the audio in this video seriously for real?\n\nDid this little guy just wonder up on your deck one day or what?"
  },
  {
    "commentText": "I love animals. We do the same thing when something is delicious."
  },
  {
    "commentText": "human be silent"
  },
  {
    "commentText": "I love this video so much. He's so festive and happy."
  },
  {
    "commentText": "Oh, the squeaks :D"
  },
  {
    "commentText": "translation: Oh yeah this is good! What do you call this shit? This is f**king awesome!! Oh yeah give some more of this...this is soooo goood!! Keep it coming girlie!!!"
  },
  {
    "commentText": "He says \"pumpkin\" over and over again! That is SO awesome!!"
  },
  {
    "commentText": "Who didn't like this video??? Why?? It's adorable!!! I want to hang with Teddy :)"
  },
  {
    "commentText": "He is beautiful! This is another example of the love between humans and animals. Nothing like it! God Bless this beautiful baby!"
  },
  {
    "commentText": "Awww so darn cute!!! Kind of sounds like Cousin It! LOL"
  },
  {
    "commentText": "478 pumpkins disliked this video."
  },
  {
    "commentText": "I never knew that porcupines had such a grasp on vocalizations and even emotions in his vocals.  Ted's \"Ahhhhh!\" is just adorable.  This made my day!"
  },
  {
    "commentText": "OMG I LOVE THIS PORCUPINE!!"
  },
  {
    "commentText": "i'm no animal expert\nbut that sounds like a happy porcupine if I ever heard one."
  },
  {
    "commentText": "sounds like an ewok lol"
  },
  {
    "commentText": "Since porcupines aren't social by nature, what exactly to these sounds 'mean'?"
  },
  {
    "commentText": "i wish we could make quill-less domesticated porcupines... i'd love to snuggle one! lol"
  },
  {
    "commentText": "The noises this little guy makes are adorable."
  },
  {
    "commentText": "are his teeth red?"
  },
  {
    "commentText": "do they  really vocalize like that or is it added post production ?"
  },
  {
    "commentText": "He's just so happy and cute. What a sweetie!"
  },
  {
    "commentText": "Haha - He said \"Like like like. Yea - I like it.\" xD"
  },
  {
    "commentText": "Who would thumbs down this"
  },
  {
    "commentText": "SO CUTE!!!!!"
  },
  {
    "commentText": "I'm a porcupine expert, and these north american Porcupinicus do not have this vocal range."
  },
  {
    "commentText": "-Teddy's inner monologue\n\n\"Silence, human. The pumpkin gods have rewarded me this day, and I shall feast like the Kings of Gaul. My adorable mewls of delight are not for thine craven ears - \"Paanyannn\", I declare! \"Paanyannn\" indeed!\""
  },
  {
    "commentText": "so sweet!!!"
  },
  {
    "commentText": "you made a great video that porcupine looks cute"
  },
  {
    "commentText": "Funniest thing I have ever seen!  LOVE Teddy, chatty little devil!"
  },
  {
    "commentText": "soooooooo adorable and obviously well cared for. Long live Teddy"
  },
  {
    "commentText": "You guys do know that the majority of these sounds are fake, right?"
  },
  {
    "commentText": "Fairly sure that those vocalizations  are not ones of pleasure but rather  an accompaniment to food guarding behavior and most likely the closest a porcupine gets to a growl."
  },
  {
    "commentText": "I didn't know my party's sigil could be soooo cute! <3"
  },
  {
    "commentText": "@0:19 the noises Teddy makes at 0:19 sounds kinda like  \"that tastes good\" xD I love the sounds Porcupines make! Very cute."
  },
  {
    "commentText": "Next record will be:\n\n\"Fuck like like, pumpkin, I am fine. A peanut, hot hot, yum, Like it.\"\n\nVery PUNK!"
  },
  {
    "commentText": "aaaaaaawwwwwww!! sooooooooo bloody cute!!"
  },
  {
    "commentText": "Do his teef never stop growing?"
  },
  {
    "commentText": "CAN YOU HOLD CUDDLE   TEDDY OR WILL HIS QUILLS GET YOU EVEN WHEN HE'S NOT MAD??"
  },
  {
    "commentText": "+Johnny elsewhere yeah I can hear him say pumpkin and thank you :)"
  },
  {
    "commentText": "I love porcupines even teddy he is so silly and curious 🙈"
  },
  {
    "commentText": "oh my god the noises they make are soooo cute"
  },
  {
    "commentText": "Ted, your tail is funny!"
  },
  {
    "commentText": "can porcupines be pets at all?"
  },
  {
    "commentText": "Haha! @ 1:23 he says \"Quite good, really good!\" HAHAHAHA"
  },
  {
    "commentText": "I wonder if he taste like pumpkin"
  },
  {
    "commentText": "Is he food guarding?"
  },
  {
    "commentText": "SO CUTE!!!!!"
  },
  {
    "commentText": "LOL"
  },
  {
    "commentText": "Wowwww. I like it! Nature for me is all. like my friend. I subs your channel. Have a good night."
  },
  {
    "commentText": "This video always puts a smile on my face when I need it. So adorably happy with his pumpkin 😍"
  },
  {
    "commentText": "He is so CUTE!  I love him.  He sounds like Cousin It from The Munsters. hahahahaha!!!"
  },
  {
    "commentText": "my heart melted lol"
  },
  {
    "commentText": "now is this really his voice or is that just some kind of special effect"
  },
  {
    "commentText": "cute"
  },
  {
    "commentText": "so"
  },
  {
    "commentText": "porcupines can now talk?!?!"
  },
  {
    "commentText": "SO CYUTEEEEE AKA KAWAIII AKA... UM...JUST LITERALLY ADORABLE!! HOW COULD YOU NOT LOVE THIS?!"
  },
  {
    "commentText": "I had no idea that porcupines made those kinds of noises. I recently saw some footage of a couple of S.American species making the noises, and I wanted to see if our porcupines did the same. I guess it's just a porcupine thing in general ...which is great because I've always loved the sounds that rodents make. (..^_^..)"
  },
  {
    "commentText": "Oh my God I can't stop watching Teddy I want one he  he makes me smile Thank you Teddy O love you!! awhhhh"
  },
  {
    "commentText": "Did he have a case of the belly aches later that day?"
  },
  {
    "commentText": "OMG THEY MAKE SOUNDS! it's so creepy Wtf......"
  },
  {
    "commentText": "AWWW😍😍😍"
  },
  {
    "commentText": "Someone from Star Wars needs to be recording these sounds."
  },
  {
    "commentText": "He is a very cute little guy."
  },
  {
    "commentText": "Oy! Ake!"
  },
  {
    "commentText": "SoOoo beany Sweet 💕💕💕💕🙌🙌"
  },
  {
    "commentText": "2:08 \"I think you finished that one.\"\nT: \"HEY!!\"\n\"Here's another one\"\nT: \"What are you doing?\" \n\"I'll put it right here.\"\nT: \"Thank you, thank you, thank you!\""
  },
  {
    "commentText": "Plot twist: he was  actually voiced by Michael Winslow"
  },
  {
    "commentText": "She can talk to porcupines !!"
  },
  {
    "commentText": "Sooooooooooooo cute in one1⃣ part in the video🎥 its like its saying thank you 😊😊😊😊😊😊😍😍😍😍"
  },
  {
    "commentText": "How amazing!  I never knew a porcupine could talk.  Wow!"
  },
  {
    "commentText": "Pumpkins are poisonous for porcupines clearly this owner is abusive and has no business taking care of the poor animal. My mom just came in to bring me some chicken tendies and I was so upset by this video that I screamed at her and knocked the tendies out of her hand and told her to leave my room. This country is so fucked why is this happening?!"
  },
  {
    "commentText": "YOU CAN OWN PORCUPINES?!?! WHY DO I LIVE IN A COUNTRY WITHOUT THEM?!?!?!"
  },
  {
    "commentText": "Jawa in disguise? I think so"
  },
  {
    "commentText": "He sounds just like Cousin Itt."
  },
  {
    "commentText": "Someone should tell Teddy not to talk with his mouth full."
  },
  {
    "commentText": "i gotta say you have such a model female voice, like you're the person that lives in my gps"
  },
  {
    "commentText": "I'm a porcupine and this offends me"
  },
  {
    "commentText": "I love Teddy."
  },
  {
    "commentText": "Reminds me of \"Cousin It.\""
  },
  {
    "commentText": "Nice marmot."
  },
  {
    "commentText": "come on people! its not a tortoise or a dog,if you want to know what it is LOOK AT THE TITLE (not trying to sound mean but really)"
  },
  {
    "commentText": "It sounded like he said \"This is fun\" at one point xD"
  },
  {
    "commentText": "So how do you cuddle with a porcupine?  Very carefully....\nThis is totally ADORABLE <3"
  },
  {
    "commentText": "OH MY GOODNESS!!! THis is the CUTEST thing ever in the history of CUTE!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
  },
  {
    "commentText": "sounds like cousin it"
  },
  {
    "commentText": "<3 <3 <3 <3 <3 <3 ³"
  },
  {
    "commentText": "I think he says \"go away with your camera, i`m eating yummies\". I`ve heard same talking sounds from my cats when they eat rare things like meat or fish."
  },
  {
    "commentText": "1:15 Legit sounds like it is saying, \"Oh god, pumpkin, pumpkin.\""
  },
  {
    "commentText": "I swear I could hear him say \"Pumpkin!\" and \"Thank you!\" :D"
  },
  {
    "commentText": "Teddy sounds like Cousin Itt from the Addams Family!"
  },
  {
    "commentText": "Oh my goodness, this is so delightful!"
  },
  {
    "commentText": "Dang it !!!  I loved the video , but I DO NOT SPEAK PORCUPINE ! Well not much anyway ...  Why wasn't this Video released with subtitles so I could follow the conversation ?  ...I mean , I caught the part where he related the taste and texture to a Camas root ... and the occasional \"Yeah\" and \"yep\" , \"yep\" \"yeah , sure\"  ... and oh ,  \"I got it covered , just set the other one down right there , I'm not done with this fine plump gourde ... just leave it right there , Thanks\" ... but honestly , I couldn't understand much more ... please revise this video with subtitles/texts , Ok ?"
  },
  {
    "commentText": "Sounds and Kinda looks like Cousin It.  I wonder if they based Cousin It on one of these little guys."
  },
  {
    "commentText": "Can I be as happy with my life as that guy is with his pumpkin?"
  },
  {
    "commentText": "how did she get pokemon go so early?"
  },
  {
    "commentText": "Teddy likes it."
  },
  {
    "commentText": "Thank you for a clip that put such a smile on my face I'm sharing and maybe some of my friends will donate just because of the entertainment."
  },
  {
    "commentText": "Awww"
  },
  {
    "commentText": "I see he is on a deck is this your personal pet? Does he walk around the yard or is this a zoo? \nCould you explain the environment he is in ?\nThanks!"
  },
  {
    "commentText": "soooo cute"
  },
  {
    "commentText": "So cute!"
  },
  {
    "commentText": "I love this.  Thanks for sharing"
  },
  {
    "commentText": "Is that the Porcupines real voice?"
  },
  {
    "commentText": "Made my day!"
  },
  {
    "commentText": "Rename this, \"African Child Tries Food for the First Time.\""
  },
  {
    "commentText": "Basically, he's saying 'Get the @#$% out of my face, I'm trying to eat here.' In fact, he charges the camera on several occasions throughout the video. The noises he makes are cute, the fact that this woman is invading this animals personal space are not."
  },
  {
    "commentText": "What does the porcupine say?  :D"
  },
  {
    "commentText": "so many cute sounds!! What a sweetie."
  },
  {
    "commentText": "looks like teddy burnt out a few servers"
  },
  {
    "commentText": "I didn't know they can make noises I thought it was a dog at first"
  },
  {
    "commentText": "Not my proudest fap"
  },
  {
    "commentText": "I love these videos, but just FYI, no need for human dialog..."
  },
  {
    "commentText": "I freaking love this video. That's about the custest thing."
  },
  {
    "commentText": "I love this porcupine. I could cry laughing he is so adorable."
  },
  {
    "commentText": "Ahh, he sounds so happy.  X3"
  },
  {
    "commentText": "the porcupine is so adorable I can't think about the porcupine pluse was it talking I love the way that porcupine talks its so cute"
  },
  {
    "commentText": "Aww"
  },
  {
    "commentText": "452 trolls have checked in, I see."
  },
  {
    "commentText": "This is so cute I threw up in my mouth a little"
  },
  {
    "commentText": "is the sound really from the porcupine or just a digitally made voice ??? are they really can speak ?"
  },
  {
    "commentText": "This is awesome!!!  Sounds like a 2-3 year old girl!  And who's the woman speaking?  Great voice!!!  Should be on TV or radio!!"
  },
  {
    "commentText": "OMG porcupine noises are cute"
  },
  {
    "commentText": "SO freaking ADORABLE. Happier about a pumpkin than I'll ever be for anything."
  },
  {
    "commentText": "OH MY GOD WHAT ARE THESE NOISES THIS IS ADORABLE"
  },
  {
    "commentText": "Well, at least we know where \"It\" got his voice."
  },
  {
    "commentText": "I can't help but thinking that what this porcupine is saying. Probably \"if you touch my pumpkin bad things will happen to you."
  },
  {
    "commentText": "so kawai"
  },
  {
    "commentText": "Cousin It must have been based off Teddy"
  },
  {
    "commentText": "I would like to see his reaction if he would eat a watermelon."
  },
  {
    "commentText": "она же угрожает"
  },
  {
    "commentText": "He said it I heard it, PUMPKIN !  LOVE YA TEDDY !"
  },
  {
    "commentText": "OMGosh!!  I had no idea that they could \"talk\" like that.  This is so adorable!!!"
  },
  {
    "commentText": "The physical and vocal resemblance to Cousin Itt makes me think that Teddy Bear is distantly related to the Addams Family."
  },
  {
    "commentText": "They found Cousin It!!!"
  },
  {
    "commentText": "I love him Teddy your adorable"
  },
  {
    "commentText": "I can understand everything that this little chap is expressing... Is this a fake or real, unedited footage?"
  },
  {
    "commentText": "OMG!!!!My friend has a porcupine just like this one"
  },
  {
    "commentText": "This is the most adorablest... is that a word? what ever, that creature is adorz ;3"
  },
  {
    "commentText": "OMG I WANT ONE SO BAD!!"
  },
  {
    "commentText": "When did Teddy start talking at"
  },
  {
    "commentText": "soooo cute"
  },
  {
    "commentText": "awww how cute"
  },
  {
    "commentText": "11m views."
  },
  {
    "commentText": "Cousin It from the Adams Family,?"
  },
  {
    "commentText": "what kind of lonely sad piece of shit dislikes this video?"
  },
  {
    "commentText": "He's telling stories while he's eating, ADORABLE..."
  },
  {
    "commentText": "do you pet him"
  },
  {
    "commentText": "When will there be subtitles for Teddy?  His vocalizations do sound eerily like speech. :)"
  },
  {
    "commentText": "rated very high on the adorable scale"
  },
  {
    "commentText": "He is adorable!!  I've seen them around but only looked one in the eye a couple of weeks ago for the first time.  What a strange creature, intelligent, this one had an odd visage, like this black rod with eyes, like some alien. lol  Then yesterday I saw one on the side of a dirt road with it's face chewed off. Poor thing. We have a lot of those vile fishers in the mountains here."
  },
  {
    "commentText": "The Lil MF was talkin"
  },
  {
    "commentText": "Thank you Ron funches for bringing me here. This is my new, restore faith in humanity clip."
  },
  {
    "commentText": "Sounds like an Ewok. Didn't know porcupines made sounds. Love the internet; learn something new every day."
  },
  {
    "commentText": "He's like a little monkey"
  },
  {
    "commentText": "I LOVE Teddy Bear.  ♥"
  },
  {
    "commentText": "this is the cutest thing ive ever seen in my entire life"
  },
  {
    "commentText": "OMG! He SO vocal and adorable. Love this little guy."
  },
  {
    "commentText": "The noise it makes!!!! OMG LOL!!!😂😂😂😂"
  },
  {
    "commentText": "i didnt know that they did that sounds lol"
  },
  {
    "commentText": "Spanky can't get enough of his videos,   she seems to understand everything he says  ahahah"
  },
  {
    "commentText": "Instead of Teddy Bear, his name should be Cousin Itt."
  },
  {
    "commentText": "so fUCKING PURE"
  },
  {
    "commentText": "found a wild Pokemon on the Internet"
  },
  {
    "commentText": "I demand more footage of this Porcupine eating things."
  },
  {
    "commentText": "This is so precious that it brings me to tears. God's amazing creatures! Thank you for sharing Teddy with us."
  },
  {
    "commentText": "Fascinating!"
  },
  {
    "commentText": "i never knew they ate pumpkins"
  },
  {
    "commentText": "I will never get over those nommy noises of his. So freaking cute."
  },
  {
    "commentText": "Donald Duck in disguise!!!!!!!!!!!!!!!!!! HA HA"
  },
  {
    "commentText": "0.52 \"It's a pumpkin\" he is so cute."
  },
  {
    "commentText": "Oh my god, it sounds like it's talking hahaha! I wanna translate it. Excuse the expletives, lol.\nLady: \"Well, I think Teddy bear found some pumpkins for Halloween! What'd you find, Ted?\"\nTeddy: \"OH man nigga! Fuck yeah! Fuck! (chomp chomp chomp)\"\nLady: \"Did you get it? Pick it up!\"\nTeddy: \"AWWW YEAHHHH YEAHHH! AWWWWHHHHH!\"\nLady: \"Good boy!\"\nTeddy: \"HMPH!\"\nLady: \"What is it, Teddy? Pumpkin?\"\nTeddy: \"I'm fine, fine. Hell yeah!\"\nLady: \"Can you say \"Pumpkin?\"\nTeddy: \"Alright, fuck that! What the hell is that? Fuck! Hell yeah!\"\nLady: \"Looks good!\"\nTeddy: \"Aww yeah, I'm not gonna lie, fucking pumpin, man. I like it! I like I like I like it! Fuck yeah! It's fiiiiine! Fuck, baby. Oh yeah! \"\nLady: \"Yum yum?\"\nTeddy: \"YEAH! Fuck, oh yeah! Oh, I lost a bite (piece of pumpkin falls off) Fuckin' A! Fine, oh well. Fuck, baby. Yum yum yum! I got a foot, uhhhh… it's fine! Fine. Fuckin' fuck. Mothafucka, YUuUUuUUUuum. PERFECT! cough ahhh! (chomp chomp chomp)\"\nLady: \"I think you finished that one.\"\nTeddy: \"AWWW! Fuck!\" \nLady: \"Here's another one, I'll put it right here.\"\nTeddy: \"Thank you! Thank you thank you! (heavy breathing)\"\nLady: \"What do you think Teddy? Is that as good as pumpkin pie?\"\nTeddy: \"I THINK! Uh huh, uh huh, uh huh! AHHH!\"\nLady: \"Pretty good stuff?\"\nTeddy: (pause) FUCK! Ohhh yeah! Yeah, not too bad! OHH YEAH! Fuck yeah! All of it, right there, (chomp chomp).\"\nLady: \"Good boy Teddy.\"\nTeddy: \"THANKS!\""
  },
  {
    "commentText": "did this racist ass our quinine said I'm fine nigga? porcupine aren't born racist they are taught"
  },
  {
    "commentText": "This is just...I...oh, the cute! \n::I die::\n\n}:)"
  },
  {
    "commentText": "OMG THOSE SOUNDS ARE SO ADORABLE"
  },
  {
    "commentText": "So cute the way he talks.  LOL"
  },
  {
    "commentText": "What!!!!???\nIs that real his voice?or someone doing behind him?!\nI can't believe like a voice of cartoon character!😭😭😭❤️❤️❤️"
  },
  {
    "commentText": "442 WEIRDOS don't like this video.... :O"
  },
  {
    "commentText": "this video changed my perspective of the world. my chirakas are now alligned"
  },
  {
    "commentText": "How did you teach him to talk,Or did he just learn it"
  },
  {
    "commentText": "O_O"
  },
  {
    "commentText": "I had no idea that porcupines spoke ewok."
  },
  {
    "commentText": "No anime character could touch on the cuteness levels of Teddy Bear."
  },
  {
    "commentText": "Anyone else want a Porcupine for a pet? I do. 😏"
  },
  {
    "commentText": "How adorable is Teddy??  Love his little voice while pumpkin munching."
  },
  {
    "commentText": "Is THAT where they got the idea for Cousin It on \"The Addams Family\"?"
  },
  {
    "commentText": "this is the cutest thing ever!!!"
  },
  {
    "commentText": "His sounds remind me of the original cousin It from the 60s Addams Family tv show"
  },
  {
    "commentText": "I wish I could understand Porcupinese."
  },
  {
    "commentText": "Those tiny pumpkins looks cute...."
  },
  {
    "commentText": "Oh my gosh, I never knew how adorable these guy are. It is odd, they do sound like they could speak. I mean human speak.  It's so wonderful to see something loving his food so much."
  },
  {
    "commentText": "I just cant even!?!?!?!?!?!?!?!?!?!?!?!?!?!?! :# l have no idea wat is hapening but so CUTEEEEEEEEEEEEEEEEEE! >.<"
  },
  {
    "commentText": "Okay this porcupines mouth needs to be washed out with soap my porcupine doesn't curse half as much as this."
  },
  {
    "commentText": "That's no porcupine. It's clearly a spiky piggie. Pfft ;)"
  },
  {
    "commentText": "I know he said \"I like pumpkin\" around 55."
  },
  {
    "commentText": "He sounds like Cousin Itt from Addams family"
  },
  {
    "commentText": "This made me tear up it's sooooooooo cute I love teddy bear :)"
  },
  {
    "commentText": "ممتع جدا"
  },
  {
    "commentText": "OK I Am in love with him."
  },
  {
    "commentText": "watching him eat that makes it look good"
  },
  {
    "commentText": "Last year my cuz told me to watch this and I'm watching in 2016"
  },
  {
    "commentText": "OMG he's literally so excited he can't handle it"
  },
  {
    "commentText": "I love Teddy Bear."
  },
  {
    "commentText": "Teddy Bear is so cute!"
  },
  {
    "commentText": "You're teasing this animal. Leave him to eat. Sheesh."
  },
  {
    "commentText": "who knew porcupines were so expressive?? This is adorable!"
  },
  {
    "commentText": "OMG he is so adorable. I had no clue how vocal they are. Is he your pet?"
  },
  {
    "commentText": "That bugger gives the watcher an almost toxic load of cuteness look&sound. I'd buy me kevlar clothes just to hug him."
  },
  {
    "commentText": "Now that I know porcupines make noise my like fot like 13% better."
  },
  {
    "commentText": "The pauses followed by sudden exclamations are hilarious."
  },
  {
    "commentText": "I can hear him saying - good and like several times! this is cute overload"
  },
  {
    "commentText": "✿⊱╮a d o r a b l e  chatterbox indeed ✿⊱╮"
  },
  {
    "commentText": "omg Ive never seen anyone talk this much while eating! hahahah too cute. :D"
  },
  {
    "commentText": "1:41 Fuck, fucking hell, hell, hell, fucking hell, it's very good, fuck fuck fuck, fuck fuck, fucking hell, fucking hell, it is very good, GOOD, suck suck fuck fuck, suck suck emph, emphemphemph, emphemphemph, emphemph, emph, emphemphem, perfect, gaard, thank you, GOOD! emphemph, emph, emphemphemp - Haha, I think you finished that one - WAAH - here's another one! - WAAHAHA! - I'll put it right here - fuckfuckfuck, fuck that - You're welcome - What do you think Teddy, is that as good as pumpkin pie? - Fuck that! emphemphemph, MMM - Pretty good stuff? - Hey, heey! I love this... Piie.. Fuck that! emph, emphemph, emph - Good boy Teddy - Fuck!"
  },
  {
    "commentText": "Oh so very precious!"
  },
  {
    "commentText": "428 people are at war with cuteness."
  },
  {
    "commentText": "as cute as it sounds,it's obvious this animal wants you to leave him and his food alone. i think it's horrible."
  },
  {
    "commentText": "Didn't Snoopy speak making those noises?"
  },
  {
    "commentText": "My heart just exploded out of my chest! That's adorable!!"
  },
  {
    "commentText": "HE SOUNDS LIKE YOSHI!!! >:O"
  },
  {
    "commentText": "He sounds like Cousin IT of the Addams Family, only you can understand Teddy better :-)"
  },
  {
    "commentText": "+Zooniversity Teddy looks so cute~! He may look cuddly, but I wouldn't want to risk it. Haha! \nHow long have you had him? ^^"
  },
  {
    "commentText": "This is really interesting. I guess our speech must sound as incomprehensible to him as his vocalizations do to us.\nI wonder how many other species of animals make vaguely speech-like vocalizations like that?"
  },
  {
    "commentText": "I wish I loved anything as much as this little fucker loves pumpkins."
  },
  {
    "commentText": "sound like a dog"
  },
  {
    "commentText": "It's cute"
  },
  {
    "commentText": "This lady has a hot librarian voice"
  },
  {
    "commentText": "bear is holding a conversation this is good"
  },
  {
    "commentText": "Haha, 2:09 \"I think that one's finished\"\"Woman, I will TELL you when I'm done!\""
  },
  {
    "commentText": "Wow, I would so cuddle that nose!"
  },
  {
    "commentText": "Sounds like a Gremlin."
  },
  {
    "commentText": "I cry."
  },
  {
    "commentText": "he's a bit of a rude one..."
  },
  {
    "commentText": "I wanna hug him but I can't."
  },
  {
    "commentText": "I thought she was fast-forwarding the video as it sounds like a human talking...but that's how they sound?  So cute!"
  },
  {
    "commentText": "Watch this and say it isn't cute. I dare you"
  },
  {
    "commentText": "My professor sent me here lol"
  },
  {
    "commentText": "I like this dog."
  },
  {
    "commentText": "He makes more sense than most politicians we know."
  },
  {
    "commentText": "omg so cute :3"
  },
  {
    "commentText": "That is one happy porcupine!!!! LOL..."
  },
  {
    "commentText": "THANK U RON FUNCHES"
  },
  {
    "commentText": "Wow. He sounds so close to human speech."
  },
  {
    "commentText": "He is so cute. :) How long have you been caring for him?"
  },
  {
    "commentText": "Man he's answering her questions! I don't know what the hecks he's saying to her but he's answering her! Pretty much the CUTEST THING EVER!!!"
  },
  {
    "commentText": "Oh come on. It sounds cute, but what person who has experience with animals doesn't know his vocalizations are him telling her not to go near his food? He jerks up towards her every time she moves in for a closeup. He's trying to chase her away. It's animal defending-its-food behavior. He just happens to make sounds that are cute to humans rather than growls."
  },
  {
    "commentText": "First instinct is to cuddle......what's he saying? My heavens. I never knew they made such noises."
  },
  {
    "commentText": "I would never have guessed that that noise would come out of that animal.  Very cartoony and super cute."
  },
  {
    "commentText": "Theres no way this sound is legit"
  },
  {
    "commentText": "This is just the kind of stuff  you need to get through life. news of bombings and shootings,pressured to do well in academics, college applications,being broke,sports,things that cause stress which seems to be like 90% of all things and events now.\nthis is like one of those pockets of air you luckily run into to keep you going through of life.\nthank you mr porcupine for you have made my day."
  },
  {
    "commentText": "This has to be one of the cutest things I've seen in a long time.  He's so adorable."
  },
  {
    "commentText": "Why is he in your house? And why are you making money off of a wild animal? You should be ashamed of yourself! Let him go!"
  },
  {
    "commentText": "porkupines are pretty docile animals even in the wild. I have came across a few when out hunting and they have no fear or agressiveness when provoked. I even brushed back the quills and picked one up by the tail one time. He just simply looked at me. I then put down the creature and let him waddle off"
  },
  {
    "commentText": "He sounds like Cousin Itt!"
  },
  {
    "commentText": "If you slowed down the audio of the last half I reckon it would have sounded like a porno movie. The little fella was hitting all the notes."
  },
  {
    "commentText": "it's like having 1,ooo  orgasms"
  },
  {
    "commentText": "That's the way, fatten him up on pumpkins & then roast him slowly over an open flame...delicious. :P"
  },
  {
    "commentText": "We have a type of porcupine out here but to be honest i dont think i ever seen one...  and wow the noises he made...  i dk why but yeah i just watched the whole thing.. i am always amazed at how sweet most animals are."
  },
  {
    "commentText": "They make the weirdest noises!"
  },
  {
    "commentText": "Little ELF sounds! That must be where they get them from for movies and things. That is just GREAT."
  },
  {
    "commentText": "The Pugs want to initiate Teddy Bear into their grumble regardless of the fact that he has sharp claws and prickly \"spines\".  ;-)   OMG, I had no idea that porcupines made sounds like this.  He is precious!\n\n\nThis and the rest of the Teddy Bear videos should keep The Pugs amused for weeks to come (yes, the dogs watch YouTube animal videos - they are a great babysitter especially when you need to do something in the evening without \"doggie disturbances\")."
  },
  {
    "commentText": "How is the person holding the camera this calm?"
  },
  {
    "commentText": "Why are people putting thumbs down this is cute!!im so mad!!!"
  },
  {
    "commentText": "I didn't know they were so wordy"
  },
  {
    "commentText": "I WACHED THIS IN MUSIC I THANK IT IS FUNNY"
  },
  {
    "commentText": "He's not excited, he's pissed off that ur so close to his food."
  },
  {
    "commentText": "Im glad this is a wildlife rescue centre and not some random person feeding -  thanks for giving these critters a home Allison :) \nToo often, people buy exotic pets on a whim then abandon them when they're too much work or they find out they are not allowed in their city or town."
  },
  {
    "commentText": "He's cousin it!!"
  },
  {
    "commentText": "Anyone else feel like his body language was saying, 'these are mine, piss off'?"
  },
  {
    "commentText": "Wow he sounds like a Ewok and a Pikmin."
  },
  {
    "commentText": "😂😂"
  },
  {
    "commentText": "Теди хороший милый парень. Спасибо за позитивчик!"
  },
  {
    "commentText": "OMG It sounds like Cousin It from The Adams Family Show."
  },
  {
    "commentText": "that is sooo adorable i only watched this one video but, it tempted me to subscribe! yaaaay!"
  },
  {
    "commentText": "slows down and plays backwards\n\n\"FLOOP IS A MADMAN, HELP US SAVE US\""
  },
  {
    "commentText": "ok stop trying to make the animal talk we don't live in a fairy tale world dumbasses"
  },
  {
    "commentText": "Dispite what it looks like, I'm pretty sure it's a squash... Not a pumpkin \nNot that it really matters..."
  },
  {
    "commentText": "he's saying leave me alone while I'm eating or I will shoot 2000 quills into your face"
  },
  {
    "commentText": "OMG, I NEED HIM😭 this is by far the cutest thing ever"
  },
  {
    "commentText": "cute as hell .. love it!"
  },
  {
    "commentText": "Super cute!"
  },
  {
    "commentText": "Awwww bless him!"
  },
  {
    "commentText": "i just wish the woman would shut the hell up."
  },
  {
    "commentText": "It's a Pokemon"
  },
  {
    "commentText": "Holy shit it's so fucking adorable! Can't resist the cute"
  },
  {
    "commentText": "\"GET THAT CAMERA OF MY FACE!!!\" and some profanities..."
  },
  {
    "commentText": "what a chatty little creature! did he actually respond to your \"pick it up\"? or is that just a coincidence?"
  },
  {
    "commentText": "Omg the woman even sounds like the porcupine mother from Over The Hedge"
  },
  {
    "commentText": "awwwwww the sounds are so cute. I wish I could give Teddy my pumpkins; he's adorable."
  },
  {
    "commentText": "This video was shared and made many people happy. Thank you for showing us a little heaven on earth. Teddy is sure lovable."
  },
  {
    "commentText": "When you want to talk about your day but you're really hungry!"
  },
  {
    "commentText": "Teddy is very cute, he's sounds like a puppy lol. It also sounds like he repeatedly tries to say pumpkin! I would love to see more Teddy videos☺"
  },
  {
    "commentText": "He's so cute. <3"
  },
  {
    "commentText": "It sounds like an animal crossing villager."
  },
  {
    "commentText": "that is so adorable."
  },
  {
    "commentText": "I make those same noises when eating cheesecake. Teddy is just too adorable <3"
  },
  {
    "commentText": "I never knew a porcupine talked so much or what they sounded like"
  },
  {
    "commentText": "VERY KOOL. IS TEDDY STILL ALIVE. I KNOW RODENTS DO NOT LIVE LONG, HAD TWO CAVIES, & THIS SEEMS TO BE LAST VID MADE. HOPE HE IS. XX   ;D"
  },
  {
    "commentText": "Love his little paws there. they remind me of totoro's hands."
  },
  {
    "commentText": "Can the obnoxious human commentary be edited out? PLEASE."
  },
  {
    "commentText": "His response to the human voice and the sounds of delight as he ate the pumpkin was most interesting...Thank you for sharing this ...   first time I heard a porcupine sound..."
  },
  {
    "commentText": "Those noises = uncanny valley"
  },
  {
    "commentText": "Sounds like he's really enjoying that pumpkin!"
  },
  {
    "commentText": "it sounds like the squirrel from disney's the sword in the stone"
  },
  {
    "commentText": "Were those real pumpkins? \nPorcupines are so cute!"
  },
  {
    "commentText": "\"I can't seem to eat this damn thing fast enough\""
  },
  {
    "commentText": "What an adorable little guy!  He sure does love his pumpkins. Thanks so much for sharing!"
  },
  {
    "commentText": "literally me"
  },
  {
    "commentText": "HE IS SO HAPPY!"
  },
  {
    "commentText": "sounds like its having breathing issues lol"
  },
  {
    "commentText": "OMG this is  absolutely PRECIOUS. Thank you for making my week. I'm melting."
  },
  {
    "commentText": "so cute <3"
  },
  {
    "commentText": "a pet that you can't pet lol"
  },
  {
    "commentText": "I WANT TO HUG HIM SO MUCH\nIT WOULD BE SUCH A BAD IDEA"
  },
  {
    "commentText": "Hard to believe these sounds are really coming from the porcupine but it is a very cute and entertaining video.  Got me smiling that's for sure."
  },
  {
    "commentText": "How funny he is! The bigger brother of my guinea pig"
  },
  {
    "commentText": "this is so cute"
  },
  {
    "commentText": "Close your eyes while watching this.\nDon't tell me you can't hear \"Worms: Armageddon.\""
  },
  {
    "commentText": "he is too adorable!!!"
  },
  {
    "commentText": "Squeal!!!!! So cute!"
  },
  {
    "commentText": "That's really wonderful!"
  },
  {
    "commentText": "I never thought i'd want to snuggle with a porcupine, until now."
  },
  {
    "commentText": "He doesn't want the Halloween candy he is all in for the pumpkins!😄"
  },
  {
    "commentText": "is that nicki minaj!!?"
  },
  {
    "commentText": "Awwwwwww!!!! his lil noises!"
  },
  {
    "commentText": "Wow. Too cute. Way too cute!"
  },
  {
    "commentText": "Things I've learned from YouTube #347: Porcupines make the second-cutest noise EVER (the first, of course, being turtles humping shoes)."
  },
  {
    "commentText": "1:24 \"fun fun, this is Fun !\"   Wow."
  },
  {
    "commentText": "holy lol"
  },
  {
    "commentText": "I swear it sounds like Teddy is actually talking.  It just doesn't sound like noise to me."
  },
  {
    "commentText": "Is he still alive?"
  },
  {
    "commentText": "1. ew he's like a little gremlin.\n2. can you zoom out a bit?"
  },
  {
    "commentText": "I don't even know how I came across this, but - That. Was. Adorable. And I also love how you don't talk to him in \"cutsey baby/animal\" speak. THANK YOU! I find animal videos that have human companions with high-whiney-octive voices very annoying. Somehow it's ironic to say that to someone with an actual porcupine... ( ! )"
  },
  {
    "commentText": "Up next: KALAHARI BUSHMEN: porcupine hunting :D"
  },
  {
    "commentText": "YOUR VOICE IS SO SEXY"
  },
  {
    "commentText": "he has a lot to say"
  },
  {
    "commentText": "OMG!!!!!! Cuteness overload!!!"
  },
  {
    "commentText": "So cute i wanna eat it!"
  },
  {
    "commentText": "Teddy actually says Pumpkin!!!!! And \"I like it, I like it, it's nice\"... Cutest ever!!!! xxxx"
  },
  {
    "commentText": "Animal Crossing really nailed the sound of animals talking."
  },
  {
    "commentText": "I totally get it. That porcupine really spoke to me."
  },
  {
    "commentText": "He's so cute! I can't stop watching this!"
  },
  {
    "commentText": "Can you pet it?"
  },
  {
    "commentText": "ha ha ha ha .. Just to cute...."
  },
  {
    "commentText": "This owner sounds like a total condescending bitch."
  },
  {
    "commentText": "This fake nonsense annoys me."
  },
  {
    "commentText": "precious!"
  },
  {
    "commentText": "I feel like he should now open a door to the next level."
  },
  {
    "commentText": "What does he feel like?"
  },
  {
    "commentText": "This video and Ted made me soooo happy and warm inside. Thanks for posting. It's so wonderful. Smiles."
  },
  {
    "commentText": "\"Can you say pumpkin?\"\nNo. He can't. Teddy's a porcupine."
  },
  {
    "commentText": "Adorable!"
  },
  {
    "commentText": "Mighty Magiswords!  Porcupine Magisword!"
  },
  {
    "commentText": "i never knew porcupines were so talkative."
  },
  {
    "commentText": "Oh goodness, he sounds so cute."
  },
  {
    "commentText": "HE SOUNDS LIKE A LITTLE SQUEAKY-TOY. I WANT 50 OF THEM"
  },
  {
    "commentText": "This is too much."
  },
  {
    "commentText": "I desire to hug him."
  },
  {
    "commentText": "wow, do porcupines always make noises like that?  i had no idea!  that's so cute!"
  },
  {
    "commentText": "ron funches"
  },
  {
    "commentText": "My reaction to chocolate!\nThis guy is too much"
  },
  {
    "commentText": "I didn't think I've needed a porcupine but now I need one."
  },
  {
    "commentText": "he is so sweet!!!!!! like a cartoon lol"
  },
  {
    "commentText": "aww thank you for posting this"
  },
  {
    "commentText": "thank you mr funches"
  },
  {
    "commentText": "Thank you Ron Funches"
  },
  {
    "commentText": "Would he bite you if you tried to touch him while he was eating his pumpkin?"
  },
  {
    "commentText": "Cousin Itt!"
  },
  {
    "commentText": "TIL that porcupines are actually Pokémon."
  },
  {
    "commentText": "Dear god, it sounds like a freaking Pokemon"
  },
  {
    "commentText": "Wow.  A pet porcupine?  Brave woman!  Lol!"
  },
  {
    "commentText": "His fur looks soft!"
  },
  {
    "commentText": "That was so cute I think I just ovulated."
  },
  {
    "commentText": "His \"Banter\" is quite adorable. ;)"
  },
  {
    "commentText": "Porcupines are wild animals, they should stay in the wild. Even if the person who made this video actually has some legitimate reason for keeping it as a pet, releasing \"cute\" anthropomorphic videos encourages people to see them as potential pets. Wrong on so many levels."
  },
  {
    "commentText": "I LOVE Teddy!"
  },
  {
    "commentText": "Seems to me more like get that camera out of my face"
  },
  {
    "commentText": "I swear he actually said pumpkin"
  },
  {
    "commentText": "The 384 people who have disliked this video have no souls"
  },
  {
    "commentText": "Wow, now I know where they got the voice idea for \"Cousin It\" from the 1960's TV show \"The Addams Family\".  Cousin It sounds JUST like this.  Amazing!"
  },
  {
    "commentText": "Ahh...the sounds of pleasure"
  },
  {
    "commentText": "Alien language and roar?"
  },
  {
    "commentText": "now i know where sonic get sound lol"
  },
  {
    "commentText": "HOLY SHIT PORCUPINES MAKE NOISES"
  },
  {
    "commentText": "Basic bitches and their pumpkin flavored everything amiright?"
  },
  {
    "commentText": "Oh MAAAANN!!!!  This was SUPER cool!!!   He is SOOOOO adorable!   Now I know where they got the voice of \"Cousin It\" from on the 1960's TV show \"The Addams Family\".  Cousin It's voice sounds EXACTLY like this.  It's truly amazing."
  },
  {
    "commentText": "BEYOND CUTE!!!!"
  },
  {
    "commentText": "what part of Ireland is he from ?"
  },
  {
    "commentText": "CUTE OVERLOAD!!!!! I WANT ONE!!!!"
  },
  {
    "commentText": "well someone is an adorable chatterbox.."
  },
  {
    "commentText": "So cute! And sounds like Cousin Itt!"
  },
  {
    "commentText": "I didn't know they made such cute sounds! CUTE!"
  },
  {
    "commentText": "Ha ha ha ha ha ! IR-RE-SIS-TIBLE ! I didn't have ANY idea that this animal could be such a chatterbox xD !!! It's a real conversation and he seems to be extatic ! UNIQUE ! I adore : hilarious xD !"
  },
  {
    "commentText": "It sounds like he says \"It's good I like it\""
  },
  {
    "commentText": "WAAAANT"
  },
  {
    "commentText": "what it said?? since you do not provided CC. Please transition what porcupine said?"
  },
  {
    "commentText": "MORE VIDEOS PLEASE."
  },
  {
    "commentText": "I think I heard him say \"back off\" and \"thug life\" a few times..."
  },
  {
    "commentText": "cutest thing in history"
  },
  {
    "commentText": "Completely adorable."
  },
  {
    "commentText": "I WANT THAT THING!"
  },
  {
    "commentText": "Teddy you are ADORABLE! :)"
  },
  {
    "commentText": "Lovely creature"
  },
  {
    "commentText": "I had to restart my computer. Adorable.exe was taking up all my ram trying to buffer this video"
  },
  {
    "commentText": "Those look like gourds  to me. He's still cute as bug though."
  },
  {
    "commentText": "I love Teddy."
  },
  {
    "commentText": "He's so happy!!!"
  },
  {
    "commentText": "\"This is FUCKING A-MAZ-ING!\""
  },
  {
    "commentText": "he looks so soft....hard to believe that all those hard quills come outta there....\nat any rate..he loves him some pumpkin..."
  },
  {
    "commentText": "What a funny wee character! :o]"
  },
  {
    "commentText": "I just cannot get enough of this video.  It's my go-to when I get stressed out."
  },
  {
    "commentText": "this is the cutest, most sweetest thing I've ever seen"
  },
  {
    "commentText": "this is the cutest, most sweetest thing I've ever seen"
  },
  {
    "commentText": "It's so cute how he talks. I swear it sounds like he says \"pumpkin.\""
  },
  {
    "commentText": "oh wie lieb ist das ! soooooo süüüß <3"
  },
  {
    "commentText": "this is so freaking adorable :) I just cuddle him which would probably be a very bad idea :P"
  },
  {
    "commentText": "Something about the audio seems faked on this."
  },
  {
    "commentText": "Man, that's one happy little dude. =)"
  },
  {
    "commentText": "0:18 oh, that's good!"
  },
  {
    "commentText": "AWWWWWW"
  },
  {
    "commentText": "I've never seen micro-pumpkins"
  },
  {
    "commentText": "they must sound hysterical during mating season"
  },
  {
    "commentText": ">BRAIN, this is heart. What the HELL is going on!? Why are my systems critical?\n>Heart, this is brain. We have a class ten cute factor going on out here.\n>Brain this is heart. God help us all."
  },
  {
    "commentText": "THIS MAKES ME SO HAPPY"
  },
  {
    "commentText": "He just can't even"
  },
  {
    "commentText": "SO ADORABLE OMG"
  },
  {
    "commentText": "COUSIN IT!"
  },
  {
    "commentText": "OMG!!! Cutest video ever!! Love this!! 💕"
  },
  {
    "commentText": "The last animal you'd ever want to pet...and it makes the cutest noises, just BEGGING you to want to hug it. I'd go for it."
  },
  {
    "commentText": "1:24-1:26: \"So good! So good!\" xD"
  },
  {
    "commentText": "@00:10 to 15sec \nAm I the only one that heard\n\"Goodbye nigga! f*** you\" ?\n\nI think he's trying to tell her to get away from his food..."
  },
  {
    "commentText": "At 1:42 \"PAC MAAAAAN!\"  Lol"
  },
  {
    "commentText": "At 1:42 \"PAC MAAAAAN!\"  Lol"
  },
  {
    "commentText": "How can you have such a cute animal and not pet him?"
  },
  {
    "commentText": "Haven't seen something so cute in a while xD"
  },
  {
    "commentText": "one of few animals that can talk like this one you can hear him say vary good, nom nom nom and as well as thank you and pumpkin. crud words but words never the less both cute and smart"
  },
  {
    "commentText": "The condescending tone in her voice bothers me."
  },
  {
    "commentText": "Hermoso!!!!!!!!!!!!!!!!!!!!!!!!"
  },
  {
    "commentText": "2 minutes and 51 seconds is the longest i've ever gone without shooting a porcupine."
  },
  {
    "commentText": "Related to E.T.?"
  },
  {
    "commentText": "I'm in love!!!"
  },
  {
    "commentText": "Sounds like Cousin It.  :p"
  },
  {
    "commentText": "That lady has more brass than I do. I'd give a porkypine and its food a lot wider berth than that (disallowing for the length of her zoom lens). Still funny. Sounds like Cousin Itt."
  },
  {
    "commentText": "who is she"
  },
  {
    "commentText": "her voice is awesome!!!  Disney should snap her up"
  },
  {
    "commentText": "that women makes funny noises"
  },
  {
    "commentText": "It's not cute.  She's harassing that porcupine.  It's agitated, not happy."
  },
  {
    "commentText": "SO AWESOME!!!!!!!!!!!!!!!!!!!! I LOVE IT"
  },
  {
    "commentText": "Omg that is so fucking cute. I never knew they made sounds like that!"
  },
  {
    "commentText": "he's so cute... now give him a big hug!"
  },
  {
    "commentText": "I am sure he said \" get the camera out of my face please, I'm a eatin\"\nhehehehe so funny video"
  },
  {
    "commentText": "We had these buggers under the house and in the woods behind the house when we lived in Alaska. \n\nThe ones under sounded like they were eating the freaking floor away. Had no idea what they were til I caught one on camera coming out from underneath early in the morning.\n\nI also heard these weird high pitch giggle noises in the woods at night before I realized it was them. I could see how back in the day the natives might have mistaken them for something more like an impish 'being' so to speak. They really do sound weird at night in the dark. Creepy even. D:"
  },
  {
    "commentText": "1:25 sounds like he's saying \"so much fun\" :)"
  },
  {
    "commentText": "As ridiculously cute as this is & I hate to spoil the party but it's not a display of ecstatic joy with the squeaking & head bobbing but rather a defensive display to the effect of 'back of & don't try & take my food' in the same way a domestic cat might growl if you give it something it really likes. But still NAAAWWWWW..."
  },
  {
    "commentText": "I don't know why i cant stop seeing this video. o.O"
  },
  {
    "commentText": "So cute baby!"
  },
  {
    "commentText": "That sound is so unexpected..."
  },
  {
    "commentText": "😍😍😍😊😊😊😊😊"
  },
  {
    "commentText": "😍😍😍😊😊😊😊😊"
  },
  {
    "commentText": "so cute"
  },
  {
    "commentText": "I swear at 0:12 he says \"it's fine my nigger\" .. maybe I'm just high though."
  },
  {
    "commentText": "Sounds like Cousin Itt"
  },
  {
    "commentText": "Teddy is cute.\nThank you for video."
  },
  {
    "commentText": "Talky thing ain't cha..."
  },
  {
    "commentText": "youre killing me teddy bear."
  },
  {
    "commentText": "I want a pumpkin."
  },
  {
    "commentText": "This is must be what Chewbacca sounded like as a baby XD"
  },
  {
    "commentText": "2:13 \"thankya thankya thankya\""
  },
  {
    "commentText": "I always watch him every fall.  He's so adorable.  I'd love to hear the story of how he became a pet!"
  },
  {
    "commentText": "I never knew they were so vocal and communicative!!:) They're really cool."
  },
  {
    "commentText": "they are gourds not pumpkins"
  },
  {
    "commentText": "I don't understand if he's making those cute sounds because he's happy or because she's too near to him and he's acting like that to scare her away, like dogs when they defend a toy or something."
  },
  {
    "commentText": "who knew porcupines where white chicks"
  },
  {
    "commentText": "I am Dutch and that sounds like it is saying Lekker lekker, which means nomnomnom."
  },
  {
    "commentText": "Sounds like a pikmin..."
  },
  {
    "commentText": "it should stop \"talking\" with food in his mouth.  very impolite."
  },
  {
    "commentText": "FUCK"
  },
  {
    "commentText": "This porcupine cannot contain his excitement when he tries some pumpkins for the first time"
  },
  {
    "commentText": "Animal Crossing speech in real life."
  },
  {
    "commentText": "Teddy is telling her to back up, my pumpkin"
  },
  {
    "commentText": "What breed of dog is this ?"
  },
  {
    "commentText": "That is the most adorable thing I have seen in a long time. Now to offset it, I must go and stomp some bunnies. Thanks."
  },
  {
    "commentText": "Pretty sure this is some kind of Ewok"
  },
  {
    "commentText": "can you pet a porcupine if you pet them with the grain?"
  },
  {
    "commentText": "does anyone else hear it saying \"i like it i like it i like it\""
  },
  {
    "commentText": "is this the sound a porcupine usually makes, or has this lady been talking to him so much that it's mimicking her?"
  },
  {
    "commentText": "He sounds like a Jawa from Star Wars"
  },
  {
    "commentText": "Keyori pls"
  },
  {
    "commentText": "I want one!!!"
  },
  {
    "commentText": "352 people hate their lives."
  },
  {
    "commentText": "See, now the problem is I wanna pet it."
  },
  {
    "commentText": "this thing sounds like the troll from the movie Cat's Eye!"
  },
  {
    "commentText": "can you say pumpkin? really? can a porcupine say pumpkin?"
  },
  {
    "commentText": "Can humans eat pumpkins like this? Pardon my ignorance"
  },
  {
    "commentText": "Today I learned that anime characters are voiced by porcupines."
  },
  {
    "commentText": "Sounds like Adamms family's cousin it."
  },
  {
    "commentText": "Good Show cousin IT!!!!!!"
  },
  {
    "commentText": "made me smile, ty"
  },
  {
    "commentText": "347 people don't like this? I mean even if you truly didn't like it because maybe you were attacked by a porcupine as a child, to take the time and actually click the thumbs down... wow."
  },
  {
    "commentText": "Pika Pikachuu? Pika pikaaaa!"
  },
  {
    "commentText": "cousin itt!"
  },
  {
    "commentText": "Porcupines can fucking talk? WTF!!??"
  },
  {
    "commentText": "Sounds like the characters from Animal Crossings!"
  },
  {
    "commentText": "so can you never touch a porcupine?"
  },
  {
    "commentText": "I had no fucking idea porcupines even made a noise, let alone one that sounds like it's some sort of pokemon."
  },
  {
    "commentText": "How do you take care of a porcupine without getting their needles stuck in you?"
  },
  {
    "commentText": "OH MY GOD YOU ARE KILLING ME!! THOSE NOISES ARE ADORABLE!!!"
  },
  {
    "commentText": "Pork Qpine!"
  },
  {
    "commentText": "Why kind of dog is this?"
  },
  {
    "commentText": "I guess he loves pumpkin spice everything too."
  },
  {
    "commentText": "IT'S PIKACHU!!"
  },
  {
    "commentText": "2:16 porcupine starts beatboxing."
  },
  {
    "commentText": "adorable !"
  },
  {
    "commentText": "isnt this the animal that Sonic is"
  },
  {
    "commentText": "Oshawatt"
  },
  {
    "commentText": "\"Can you say pumpkin?\" \"Nom nom!\""
  },
  {
    "commentText": "Adorable...sounds like an ewok if it's real!"
  },
  {
    "commentText": "My sides"
  },
  {
    "commentText": "I think i just fell in love with a prick"
  },
  {
    "commentText": "it's good its really really good! good good!"
  },
  {
    "commentText": "i never heard a porcupine make noises like that... and @ 0:29 - is he picking it up because he´s being told so? i dont know why, but that freaked me out a little bit :D"
  },
  {
    "commentText": "I love the sounds he makes!"
  },
  {
    "commentText": "He sounds just like cousin IT."
  },
  {
    "commentText": "\"Pick it up.\"\n\n... Like he wasn't about to do that anyways, lol."
  },
  {
    "commentText": "Sounds like Yoshi from Mario Bros."
  },
  {
    "commentText": "is that blood on its front teeth?"
  },
  {
    "commentText": "Can I pet it?  =)"
  },
  {
    "commentText": "so fake\n\nEdit: wow gold! for me? thank you reddit!"
  },
  {
    "commentText": "Sounds like an Ework"
  },
  {
    "commentText": "I just had my first ASMR experience.  I feel really dirty now."
  },
  {
    "commentText": "So do you guys trim his quills, or anything like that? even if he likes you, seems like the wrong kinda snuggle would be bad, lol"
  },
  {
    "commentText": "What kind of dog is that"
  },
  {
    "commentText": "I WANT ONE."
  },
  {
    "commentText": "Ya'know,  I'm thinking that the noises he's making is a warning to stay away. He's probably just protecting his food..I bet if you tried to snatch it away, he'd snap your fingers off! It's cute and all.."
  },
  {
    "commentText": "TIL I want a porcupine."
  },
  {
    "commentText": "🎶What does the porcupine say?🎶"
  },
  {
    "commentText": "Lol it talks like the villagers on Minecraft :P"
  },
  {
    "commentText": "It sounds like he's saying NOT BAD..over and over again...lol"
  },
  {
    "commentText": "Those are gourds, not pumpkins."
  },
  {
    "commentText": "He sounds like a character from Animal Crossing xD"
  },
  {
    "commentText": "Get that camera outta my face, bitch!"
  },
  {
    "commentText": "LMFAO!lady asked the porcupine, \"can you say pumpkin!\""
  },
  {
    "commentText": "When the camera gets to close I can actually hear it say \"back the fuck off bitch\"."
  },
  {
    "commentText": "That's pretty cute.  This video has inspired me to stop eating porcupines."
  },
  {
    "commentText": "Nice Ewok!"
  },
  {
    "commentText": "Porcupine is telling you, \"back off, I'm eating\".....in a cute, adorable way of course."
  },
  {
    "commentText": "Dang! That porcupine is ballz!"
  },
  {
    "commentText": "The reincarnation of a basic white girl"
  },
  {
    "commentText": "I LOVE TEDDY!!! <3 XOXOXOX"
  },
  {
    "commentText": "I had no idea Porcupines could be this vocal."
  },
  {
    "commentText": "that dog needs to be groomed...."
  },
  {
    "commentText": "Good! mm mmm It's good! mm mmmmm"
  },
  {
    "commentText": "WTF?  I had no idea that porcupines spoke the same language as Cousin It."
  },
  {
    "commentText": "I can't help but wonder if he's actually terrified of the woman with the camera taking his food away."
  },
  {
    "commentText": "That is so adorable, I'm going to die! Awwwwwwww"
  },
  {
    "commentText": "he is not excited, he wants you to step the fuck back"
  },
  {
    "commentText": "They probably didn't feed him for days before filming this."
  },
  {
    "commentText": "FeelsGoodMan"
  },
  {
    "commentText": "So funny the things that people down vote. Several hundred porcupine haters out there? What?"
  },
  {
    "commentText": "Who knew porcupine's spoke in Jennifer Tilly's voice."
  },
  {
    "commentText": "Like a white girl at Starbucks in the fall."
  },
  {
    "commentText": "Woman: \"Good boy teddy!\"\nPorcupine: \"Yeah!!\""
  },
  {
    "commentText": "is he saying yum yum"
  },
  {
    "commentText": "strange looking cat."
  },
  {
    "commentText": "Do they all make that noise? Is that a normal eating noise? Is it similar to how some dogs \"talk\"? If the answers are; Yes, No, Yes then I want one."
  },
  {
    "commentText": "Never knew a porcupine could be a pet."
  },
  {
    "commentText": "Damn - that'll make a turd."
  },
  {
    "commentText": "this porcupine could almost talk like a human"
  },
  {
    "commentText": "ive heard girls making the same sounds when pumpkin spice latte comes around in starbucks"
  },
  {
    "commentText": "Ayy Lmao"
  },
  {
    "commentText": "Can you pet this sort of animal? From which species of dog have you bred with this animal? Please thankyou"
  },
  {
    "commentText": "1:24 Oh that's good"
  },
  {
    "commentText": "Is this cousin It?"
  },
  {
    "commentText": "sounds like cousin It"
  },
  {
    "commentText": "So this is where Nintendo got their Animal Crossing sound files..."
  },
  {
    "commentText": "This is creepy as fuck"
  },
  {
    "commentText": "How dare they be cute when you can't cuddle or pet them damnit!!"
  },
  {
    "commentText": "How do you pet him?"
  },
  {
    "commentText": "sounds like when you play a record backwards"
  },
  {
    "commentText": "How white girls act when you buy them a venti pumpkin spice latte"
  },
  {
    "commentText": "Huh.,. Did not know that the white girls spirit animal was a porcupine"
  },
  {
    "commentText": "Did something happen to his nose?"
  },
  {
    "commentText": "Holy shit it talks! Porcupines talk!"
  },
  {
    "commentText": "I am having a terrible day but this helped so much. :)"
  },
  {
    "commentText": "Who teaches a porcupine to talk with it's mouth full........get some manners lady."
  },
  {
    "commentText": "Disgusting."
  },
  {
    "commentText": "love this"
  },
  {
    "commentText": "Such a white girl."
  },
  {
    "commentText": "What kind of dog is that?"
  },
  {
    "commentText": "I never new I wanted one."
  },
  {
    "commentText": "is this Sonic ?!"
  },
  {
    "commentText": "How do they groom themselves??"
  },
  {
    "commentText": "Pumpkupine!!"
  },
  {
    "commentText": "Precious, truly precious."
  },
  {
    "commentText": "Sounds a little like a Ghast from Minecraft."
  },
  {
    "commentText": "I did not expect that adorable little 'voice'. Soooo cute!"
  },
  {
    "commentText": "didn't know porcupines could be so cute!"
  },
  {
    "commentText": "Gourd, not pumpkin."
  },
  {
    "commentText": "Sweet!!  So you don't worry about him throwing his whatever they're called (spines?)"
  },
  {
    "commentText": "He sounds like Alvin from 'Alvin and The Chipmunks\" lol! It's too cute!"
  },
  {
    "commentText": "that thing has clearly been around humans for too long"
  },
  {
    "commentText": "omg thats so cute"
  },
  {
    "commentText": "So cute"
  },
  {
    "commentText": "Come on people... it's an anxiety reaction to the proximity of the camera/cameraperson (jammed right in its face). Fear of the food being taken, not elation."
  },
  {
    "commentText": "My cat was staring at me the whole time I was watching this. lol!"
  },
  {
    "commentText": "Now I want a tortoise AND a porcupine."
  },
  {
    "commentText": "OMG i've never heard a porcupine talk before! wow!"
  },
  {
    "commentText": "David So on JKnews brought me here."
  },
  {
    "commentText": "Oh my goodness. That is so cute!!!!!"
  },
  {
    "commentText": "minions?"
  },
  {
    "commentText": "teddy was like: Ohhh, sh**! is that all for me? great, cause i'm hungry! but, GEE-ZUS, where is my dr.pepper? lmao.."
  },
  {
    "commentText": "Cuteness overload!!!!!!!! INITIATING SELF DESTRUCT! WITH RAINBOWS!"
  },
  {
    "commentText": "I don't think he can say pumpkin."
  },
  {
    "commentText": "Sounds like hes saying \"good good, yum yum\""
  },
  {
    "commentText": "it talks"
  },
  {
    "commentText": "love this little guy!!"
  },
  {
    "commentText": "He sure sounds like Cousin It"
  },
  {
    "commentText": "How do I explain the feelings I have right now?"
  },
  {
    "commentText": "Whys his teeth all red"
  },
  {
    "commentText": "Have you ever tried putting different kinds of food in front of him at the same time, to see what he likes better? Seems to like corn and pumpkin, at least."
  },
  {
    "commentText": "Teddy Bear the Porcupine's Halloween Feast <3"
  },
  {
    "commentText": "Juste adorable..."
  },
  {
    "commentText": "evolutions finest spikey bastard"
  },
  {
    "commentText": "I had roasted porcupine in china, it tastes great!"
  },
  {
    "commentText": "Teddy bear is cute ^_^"
  },
  {
    "commentText": "are those child noises made by this porcupine !?!? wow!"
  },
  {
    "commentText": "a LOOKER and a TALKER, make for a good buddy"
  },
  {
    "commentText": "Such an interesting video on your wonderful Porcupine friend. I have never heard a critter so happy and vocal. It really sounds like he is talking to you. I don't know if this is normal behavior but, Teddy Bear is a real cute character. What a wonderful unusual critter. I really have never heard that much about Porcupines but, now thanks to this video I know I like them. Thank you for posting this great video."
  },
  {
    "commentText": "Interesting that Porcupines are so vocal, I imagine that is due to their covering of quills, which would allow them to say whatever they damn well need to...."
  },
  {
    "commentText": "too darn cute."
  },
  {
    "commentText": "he is just the cutest ever!"
  },
  {
    "commentText": "Me. Right now. :3"
  },
  {
    "commentText": "Love how he holds his pumpkin up  when he responds during conversations with his caretaker!"
  },
  {
    "commentText": "Do they really sound like that?! That is ADORABLE!"
  },
  {
    "commentText": "So cute i will now kill you and take the animal"
  },
  {
    "commentText": "The Sounds are so cute"
  },
  {
    "commentText": "\"What do you think Teddy, is it better than pumpkin pie?\"\n\"Ah yea\"\n\"Is it good Teddy?\"\n\"Yeah.... Yeah! :D\""
  },
  {
    "commentText": "Looks like Teddy Bear found some GMO pumpkins!"
  },
  {
    "commentText": "it sounds like a creature from minecraft"
  },
  {
    "commentText": "He sounds like those characters from Banjo Kazooie"
  },
  {
    "commentText": "G"
  },
  {
    "commentText": "He is adorable. How he talks."
  },
  {
    "commentText": "Great, now I have diabetes from all this cuteness, thanks a lot! XD"
  },
  {
    "commentText": "ADORABLE\non dirait qu'il parle"
  },
  {
    "commentText": "I have watched this 20x and I never get tired of it"
  },
  {
    "commentText": "Ah that's adorable. :-D"
  },
  {
    "commentText": "Cute. I love the little noises he makes!"
  },
  {
    "commentText": "IT'S TALKING!!! OMG!!! AWWWWWWWW!!!!!"
  },
  {
    "commentText": "CUTEST SOUNDS EVER!!! I had NO idea they MADE sounds! Holy shit!! Saw this on Top 20 funniest videos and died a bit from the cute!!"
  },
  {
    "commentText": "He's actually practicing a speech he's going to give later."
  },
  {
    "commentText": "I'm sorry but who would wanna have a porcupine for a pet? Not that I have a problem with it, it's just those things are mean. I had a few run-ins with porcupines in the past."
  },
  {
    "commentText": "CLACK clack! nomnomnom :D"
  },
  {
    "commentText": "I'm waiting for it to start speaking like an Ewok."
  },
  {
    "commentText": "Sounds like a minion at some times XD"
  },
  {
    "commentText": "He like try to say something=)"
  },
  {
    "commentText": "Jk news! <3"
  },
  {
    "commentText": "I love the little noises he makes! He sounds like he's talking, too cute!"
  },
  {
    "commentText": "when I make this noise while I eat, people think I'm having a seizure."
  },
  {
    "commentText": "HOLY SHIT IT'S COUSIN IT!!!!"
  },
  {
    "commentText": "Oh my gawd... how freaking adorable!!!! XD"
  },
  {
    "commentText": "The woman has the most sensual voice."
  },
  {
    "commentText": "What the fuck was that talking?"
  },
  {
    "commentText": "this is so cute"
  },
  {
    "commentText": "I could listen to Teddy talk all day with his pumpkins!  His voice is just adorable!"
  },
  {
    "commentText": "He is saying pumpkin ..amazing... I like pumpkin. Sounds like Cartman :)"
  },
  {
    "commentText": "My moms dog watches this video and loves it!! She actually loves all of Teddy's videos!!"
  },
  {
    "commentText": "Dawww so cute!! I love u Teddy Bear!!"
  },
  {
    "commentText": "When the food's so good you gotta talk to it while you're eating."
  },
  {
    "commentText": "He's REALLY enjoying this pumpkin"
  },
  {
    "commentText": "That porcupine was talking as sure as I am now..  I think Noam Chomsky should watch this video and open up the discussion of Porcupine Linguistics.  Awesome little critter."
  },
  {
    "commentText": "Teddy Bear is precious! I never knew porcupines made a sound."
  },
  {
    "commentText": "0:38\n\n\"Pumpkin!\"\n\"Can you say 'pumpkin'?\"\n\"I did!\""
  },
  {
    "commentText": "Muito bonito e gracioso seu porco espinho. parabens"
  },
  {
    "commentText": "Chipmunk. Cheeks"
  },
  {
    "commentText": "I just love all his little squeals!"
  },
  {
    "commentText": "hahahaha yes, it is Cousin IT !!!\nWow, why does he talk so much ??"
  },
  {
    "commentText": "Sounds very similar to when a cat or dog is eating and you get too close to them they worry you're going to take their food away!"
  },
  {
    "commentText": "he really doesnotlikeyou putting the camera so close to him.."
  },
  {
    "commentText": "Such a sweetie ^_^"
  },
  {
    "commentText": "Oh, you mean Teddy the Talkupine? or is it Torcupine?"
  },
  {
    "commentText": "Ja wie geil ist das denn, der vertreibt einem jeden kummer.  Was niedlich."
  },
  {
    "commentText": "He said, what is that, its good. He keeps saying good"
  },
  {
    "commentText": "I can hear him say yum yum yum over and over again hehe"
  },
  {
    "commentText": "que es lo que come?? no son de utilieria esas cosas?? no le hacen mal???"
  },
  {
    "commentText": "Teddy doesn't seem chatty so much as irritated at being disturbed while eating."
  },
  {
    "commentText": "pokemons exist!"
  },
  {
    "commentText": "Cutest shit ever"
  },
  {
    "commentText": "My heart is MELTIIIIING over Teddy Bear the porcupine 😍😱"
  },
  {
    "commentText": "Teddy Bear is so cute but is he really making those noises? I would like to believe it, but I think we are being had. It sounds like a child speaking with the sound sped up and then sychronized with his actions. Maybe I am wrong I hope so."
  },
  {
    "commentText": "no he can't say pumpkin omg"
  },
  {
    "commentText": "Love it, this is a dont try this at home but you guts know what your doing. thank you"
  },
  {
    "commentText": "I love him"
  },
  {
    "commentText": "Just curious how you keep a porcupine. Do they have quills? Or are they removed?"
  },
  {
    "commentText": "I'm allergic to adorableness!!!! 😱"
  },
  {
    "commentText": "For some strange reason, this is terrifying to me. 0.0"
  },
  {
    "commentText": "ABSOLUTELY ADORABLE!!!!!!!!!!!!!!!!"
  },
  {
    "commentText": "its  a pokemon and it likes to say quack qlack"
  },
  {
    "commentText": "Whats the deal...its on zeekly and it shoves me back to this censored site...I went there to get away from google tube...the lords of spying and censorship."
  },
  {
    "commentText": "Teddy is such a cutie and makes me laugh so hard.  He was talkative in this video!"
  },
  {
    "commentText": "this porcupine speaks pretty clear at times: at 1:25 sounds like she says \"that's good\". at 1:31 sounds like she says \"yes\" in response to the owners \"yum yum\". So cute. at 2:40 sounds like she says \"not bad\". at the end when owner says \"good boy Teddy\" her response \"thanks\""
  },
  {
    "commentText": "I love Teddy Bear!"
  },
  {
    "commentText": "Ever so cute, my friend Rickie saw one for real in America and attented me to these video's."
  },
  {
    "commentText": "THIS IS A REAL LIFE POKEMON"
  },
  {
    "commentText": "First of all, Teddy Bear you are to cute buddy.  Loveoflife how can you use that site name and talk about HATE & MURDER. This video isn't about you, calm down."
  },
  {
    "commentText": ". _. It sounds too unreal to be true..so cute. Like a cartoon chipmunk talking"
  },
  {
    "commentText": "His voice/sound is so adorable! Too cute!"
  },
  {
    "commentText": "Teddy bear is so cute. I think every animal on this planet should be respected, loved, and not taken advantage of. I wish people would realize that we should be stewards of this planet and live in harmony with all life. Just a dream though, but maybe one day that will happen."
  },
  {
    "commentText": "What's he/she saying??"
  },
  {
    "commentText": "He is so cute"
  },
  {
    "commentText": "Now I want to see him eat a baby human."
  },
  {
    "commentText": "Omg lol Awww I love this video whenever I'm sad, I just watch this and I feel better!!!! Teddy bear is adorable!!!<3"
  },
  {
    "commentText": "NIBBLER!"
  },
  {
    "commentText": "funny"
  },
  {
    "commentText": "He is REALLY trying to say things to his humans. Animals do that when they are too domesticated, they behave like humans."
  },
  {
    "commentText": "We should all be Teddy happy.  :)"
  },
  {
    "commentText": "jk news made me come here"
  },
  {
    "commentText": "I'm here because of JKNews"
  },
  {
    "commentText": "SO CUTE makes me want a porcupine. Haha"
  },
  {
    "commentText": "JustKiddingNews brought me here! :D"
  },
  {
    "commentText": "Away from the cat side of youtube, on to the porcupines now ◠‿◠"
  },
  {
    "commentText": "I think he's trying to pronounce pumpkin , not a easy word for porcupine I suppose."
  },
  {
    "commentText": "I'm in love with this porcupine and I just want to watch him eat pumpkins all day."
  },
  {
    "commentText": "It kind of seems like he's showing food aggression. It's still super cute, but his movements remind me of an animal that thinks his food is being stolen."
  },
  {
    "commentText": "He looks deceptively huggable."
  },
  {
    "commentText": "best video ever"
  },
  {
    "commentText": "i love Teddy Bear so much!  he is beyond precious!"
  },
  {
    "commentText": "What a chatterbox!"
  },
  {
    "commentText": "Please make an Instagram page!"
  },
  {
    "commentText": "tooo qute!"
  },
  {
    "commentText": "I LOVE this !!!!"
  },
  {
    "commentText": "he's telling: leave me alone!! 4 real!"
  },
  {
    "commentText": "My new goal in life is to be Teddy Bear's best friend :)"
  },
  {
    "commentText": "This is so adorable!!!"
  },
  {
    "commentText": "CUTE!!!"
  },
  {
    "commentText": "So it is decided, I will be adopting a porcupine"
  },
  {
    "commentText": "ohmugurd adorable. Too damn adorable. Stupid adorable"
  },
  {
    "commentText": "That video was so sweetly cute I think it gave me girl parts...(O.o)"
  },
  {
    "commentText": "This is about the best thing I have seen in forever.  On a side note, three days ago I witnessed a child killer trying to commit suicide while police tased him. (Yes, really.)  I needed this video.  Thank you, and thanks to Teddy!"
  },
  {
    "commentText": "I found it really cute too but, I only have a question, is it legal to have that kind of animal as a pet? I mean this is a WILD animal and I would like to see all of them in the wild but, there is some special events that makes it impossible for them to survive in their natural environment. What's his story?"
  },
  {
    "commentText": "NOOOOOOO, IM ALLERGIC TO ADORABLENESfkdsbakbsdfubdsmbgieakbdznalowksd"
  },
  {
    "commentText": "omfg did he just talk :O <3"
  },
  {
    "commentText": "I swear, it actually said pumpkin..."
  },
  {
    "commentText": "is that the noise they always make? or do they growl when frightened or upset?"
  },
  {
    "commentText": "AH IT'S DA CHEAT"
  },
  {
    "commentText": "\"Can you say pumpkin?\" \"Pyawak.\""
  },
  {
    "commentText": "Holy fk a real wookie"
  },
  {
    "commentText": "... and now we know where george lucas stole the ewok sounds."
  },
  {
    "commentText": "those are not pumkins.. looks more like oranges"
  },
  {
    "commentText": "Where's Berta Lovefuck peddling her cunt cookies?"
  },
  {
    "commentText": "OMG this porcupine sounds just like cousin It from the Addams Family!"
  },
  {
    "commentText": "So this is where Pixar goes to get it's voice over actors."
  },
  {
    "commentText": "Whoever thought a porcupine video would be so easy to fap to?"
  },
  {
    "commentText": "I could swear he is saying, \"pumpkin\". Crazy."
  },
  {
    "commentText": "Is this a human dressed as a porcupine?"
  },
  {
    "commentText": "wtf looks like a rat"
  },
  {
    "commentText": "0:40 No he can't."
  },
  {
    "commentText": "This is one of the most adorable friggin things I've ever seen/heard in my life."
  },
  {
    "commentText": "Reported this video for abusive language, at 1:24 the porcupine clearly says \"What the f*ck\". This is unacceptable."
  },
  {
    "commentText": "He is just Awesome...."
  },
  {
    "commentText": "I gotta say this is an awesome person taking care of Teddy.  \nYou Rock !!!!   And Teddy is super Awesome !!!!!!!   With his slight baby like speech,"
  },
  {
    "commentText": "Haha, do porcupines really make these sounds? Their vocal chords seem pretty similar to peoples."
  },
  {
    "commentText": "it sounds like a pokemon"
  },
  {
    "commentText": "faggot anteater"
  },
  {
    "commentText": "WHERE THE FUCK CAN I GET ONE OF THESE"
  },
  {
    "commentText": "Super cute!"
  },
  {
    "commentText": "why can't women be this excited when they meet a nice guy like me? instead, they friend zone me and go for those asshole fundies."
  },
  {
    "commentText": "Hire him to eat the pumkins the kids make. Him sitting there at night eating there creation would probely be more scary than cute."
  },
  {
    "commentText": "OK. That is the cutest damn thing I have ever seen or heard."
  },
  {
    "commentText": "He's trying to let you know that you are too close to him while he's eating."
  },
  {
    "commentText": "adorable!!!"
  },
  {
    "commentText": "@2:35 he says \"I love it.\""
  },
  {
    "commentText": "Being that 'pines are as dumb as a rock, I tried very hard to find evidence that the audio WASN'T dubbed."
  },
  {
    "commentText": "Did she ask it if it could say pumpkin?.. Silly bitch."
  },
  {
    "commentText": "WHO THE FUCK would thumbs down this video?"
  },
  {
    "commentText": "Fucking autist."
  },
  {
    "commentText": "The cutest everrrr.  So talkative...and sounds like Cousin IT from the Addams family.  :)"
  },
  {
    "commentText": "That is one spikey kazoo"
  },
  {
    "commentText": "Eww, people using google plus to comment, way to cave.\n\nNow onto the topic of this video:\n\nrofl I never knew porcupines sounded like small dogs\n#Video ROFL"
  },
  {
    "commentText": "FAKE!     'pick up the pumpkin, teddy!' and he picks it up. Nonsense! The noises and narration was clearly dubbed in later. Still the animal is very cute."
  },
  {
    "commentText": "Cousin It is alive and well :)"
  },
  {
    "commentText": "1:25 I swear I heard him say; \"This is good.\""
  },
  {
    "commentText": "Cute, but why the hell would a Porcupine be able to \"say pumpkin\"?"
  },
  {
    "commentText": "that is the cutest thing ever!! omg!"
  },
  {
    "commentText": "What you didn't see is the owner lacing it with cocaine..."
  },
  {
    "commentText": "So adorable!"
  },
  {
    "commentText": "Is that his actual voice?"
  },
  {
    "commentText": "He has thumbs!  IT'S EVOLVING!"
  },
  {
    "commentText": "Too funny!  Sounds like he's really saying Yum!"
  },
  {
    "commentText": "I want one now"
  },
  {
    "commentText": "OH MY Goodness!!! SOOOOO CUTE!!"
  },
  {
    "commentText": "i criyedd..."
  },
  {
    "commentText": "I see an awesome potential for subtitles.  Anyone want to try it?"
  },
  {
    "commentText": "This guy needs to be a character in Star Wars Episode VII."
  },
  {
    "commentText": "i wish i knew what exactly he's saying !!!!!!!!!!!!!!!!!!!!!!! BEST vid and the conversation is so catching"
  },
  {
    "commentText": "I like it when she tells him \"It looks gooood.\"   :O)"
  },
  {
    "commentText": "Soo cute.. Almost wana pet him :P"
  },
  {
    "commentText": "Hnnnnngh..."
  },
  {
    "commentText": "So cute and funny - at one point I would have sworn he said thanks ;-)"
  },
  {
    "commentText": "that looks plastic pumpkins...are there pumpkings that small?"
  },
  {
    "commentText": "Teddy is my new hero."
  },
  {
    "commentText": "I guarantee this is the cutest thing you have seen today. Hands down."
  },
  {
    "commentText": "Pretty neat. Never seen a #porcupine eat. Sure is devouring that #pumpkin"
  },
  {
    "commentText": "That is precious it makes me want to cry! He's so smart and I had no idea they could make that sound!!! Did the woman raise him from a baby? She's so blessed to have such an amazing animal :D \n\nHe's got such a cute little sound and he can actually say words - that is incredible!!!"
  },
  {
    "commentText": "he sounds like Morph!"
  },
  {
    "commentText": "wait they actually tried putting a costume on him? who thought that'd be a good idea?"
  },
  {
    "commentText": "You people that believe this stupid shit are just as stupid."
  },
  {
    "commentText": "I didn't even know porcupines even made a noise...that's so cute"
  },
  {
    "commentText": "If I had a pet porcupine, I'd listen to him eat all day long."
  },
  {
    "commentText": "Is that squeaking he's doing real or was it added for effect??"
  },
  {
    "commentText": "Hes so cute xx"
  },
  {
    "commentText": "\"Can you say pumpkin?\"\n\nIT'S A FUCKING PORCUPINE"
  },
  {
    "commentText": "sounds like an elf hahahahaha"
  },
  {
    "commentText": "Sounds like a puppy lol"
  },
  {
    "commentText": "I WANT ONE NOW"
  },
  {
    "commentText": "as long as he is not being territorial that is super cute"
  },
  {
    "commentText": "what an adorable voice.  what species is this?"
  },
  {
    "commentText": "WHY DOES HE SOUND LIKE THAT? THAT\"S WHAT A PORCUPINE SOUNDS LIKE?"
  },
  {
    "commentText": "<3 Teddy"
  },
  {
    "commentText": "OMG THIS IS SOOOO CUTE! I WANT A PORCUPINE NOW!"
  },
  {
    "commentText": "Animal Crossing"
  },
  {
    "commentText": "Aww cute. But I had no idea porcupines sounded like that lol"
  },
  {
    "commentText": "How can something so prickly sound so cute?!"
  },
  {
    "commentText": "I know what he´s saying: Shut up and get off."
  },
  {
    "commentText": "Damnit I want a pet porcupine!"
  },
  {
    "commentText": "He's just like \"FUCK YEAH, THIS IS A BOMB ASS TREAT!\""
  },
  {
    "commentText": "I could NOT stop laughing! My two toddlers were in tears gigglingnat how absolutly adorable Teddy was!!!"
  },
  {
    "commentText": "Could he be more adorable?!!!"
  },
  {
    "commentText": "What the hell. At certain angles his nose had voldermat or whatever the Harry Potters fella name is , in his nose"
  },
  {
    "commentText": "I had no idea porcupines made such adorable vocalisations. Nor did I know that they loved pumpkins. :)"
  },
  {
    "commentText": "And I thought Kittens and Puppies were cute!!!  What a cutie!  Is he really a pet??"
  },
  {
    "commentText": "How freaking cute is this?!"
  },
  {
    "commentText": "I love this little critter and his talking :-) I think he is saying, \"You better share the Google ad money you're making off this video with me!"
  },
  {
    "commentText": "It's cute but like most animals, he's talking because he's trying to keep her away from him treats, lol. She's annoying him."
  },
  {
    "commentText": "what is with the red on his teeth?"
  },
  {
    "commentText": "This is cute no matter how many times I watch it!"
  },
  {
    "commentText": "Sonic discovers pumpkins"
  },
  {
    "commentText": "What creature enjoys eating a raw pumpkin? They must have starved the porcupine prior to filming just to get this reaction out of him"
  },
  {
    "commentText": "02:47 Looks like his tummy got full. :) Adorable! <3 <3"
  },
  {
    "commentText": "Sounds a little like a TonTon from Star Wars"
  },
  {
    "commentText": "@ 2:13\n\"Thank you thank you thank you\""
  },
  {
    "commentText": "I get the feeling that Terry shouldn't eat anything after midnight. Should never take a bath either."
  },
  {
    "commentText": "Cute. I could live without the woman's voice-over though. Kind of ruins it trying to pretend the porcupine is talking back to her."
  },
  {
    "commentText": "Which just goes to show that even if your a bit of a prickly character you can still be lovable."
  },
  {
    "commentText": "This is unbelievably adorable."
  },
  {
    "commentText": "Can you say pumpkin\n\nted: Omnomnomnom"
  },
  {
    "commentText": "HE SOUNDS LIKE CATERPIE :o"
  },
  {
    "commentText": "LOL. that's not the porcupine talking, that's just the woman behind the camera making the noises."
  },
  {
    "commentText": "is so cute"
  },
  {
    "commentText": "He sys very good  this is good at 1:23"
  },
  {
    "commentText": "I never knew Porcupine's made such cute noises :D"
  },
  {
    "commentText": "Hahaha, the sound he makes is adorable!!!!!!!!!!!!!!!"
  },
  {
    "commentText": "Even though its intelligence is not on par with a human's, a creature able of that level of expression of experience deserves to be treated as best as possible."
  },
  {
    "commentText": "EEEeee!! He's so happy! :D"
  },
  {
    "commentText": "It would be incredibly unwise to let me near Teddy Bear. . . I don't think I could resist snuggling him, and that would end very poorly for me."
  },
  {
    "commentText": "It's all about that \"Yeah!\" at the end in response to \"Good boy Teddy.\""
  },
  {
    "commentText": "How funny! I've never heard a porcupine before! That's adorable!"
  },
  {
    "commentText": "He sure does like his food."
  },
  {
    "commentText": "Um.....Oo...creepy yet cute....but mainly creepy. also i think he is telling you to get the f*** camera off him and leave him with his food :))"
  },
  {
    "commentText": "oh my good it sounds and looks like an ewok :D"
  },
  {
    "commentText": "Teddy now holds the #1 spot as the most adorable creature I've ever seen....AND heard!!!"
  },
  {
    "commentText": "Wait did Teddy actually say pumpkin at 0:42"
  },
  {
    "commentText": "I didn't know porcupines made such weird noises......weird lol"
  },
  {
    "commentText": "so cute...how do you have a porcupine?"
  },
  {
    "commentText": "Какая прелесть!!!"
  },
  {
    "commentText": "Is it even real?!"
  },
  {
    "commentText": "I wonder whether he picked up the pumpkin because he was told to or he would've done it anyway."
  },
  {
    "commentText": "I'm curious to see what would happen if you backed off when he's eating. I don't think he'd protest so much because you're not threatening his food supply then. Humanize him all you want, he is an animal. Cute as a button, but an animal with instincts. \nEvery vid I've seen of Teddy, he protests the most (I'm calling it protesting, not 'talking', which is humanizing something to make people feel better, imo) when you're right in his face or trying to take his corn way ('helping' him). \nSo I'd be curious to see what he's like when he's eating without you right there."
  },
  {
    "commentText": "\"Mine! Nom Nom Nom! Mine!"
  },
  {
    "commentText": "I wonder if they based the voice for The Addams Family's Cousin It on a porcupine?"
  },
  {
    "commentText": "Is anyone else left thinking who has a porcupine as a pet? Cute video though."
  },
  {
    "commentText": "진짠가"
  },
  {
    "commentText": "I'm curious, how does one interact with one's hypothetical pet porcupine? I mean, you can't pet a porcupine, if it misbehaves you'd have issues handling him/her as well."
  },
  {
    "commentText": "not a hug-friendly Teddy Bear"
  },
  {
    "commentText": "GREAT video!!!   With what kind of camera did you record this?"
  },
  {
    "commentText": "THIS IS SO CUTE WTF"
  },
  {
    "commentText": "Kind of sounds like a Jawa from star wars."
  },
  {
    "commentText": "I know he said ive got a pumpkin and its good. You can hear that clear as day a few times"
  },
  {
    "commentText": "I would hate to have a pet that sounds like that."
  },
  {
    "commentText": "Tell teddy I said love u! Lol ur like I think u finished that one. He's like noooeee not done!"
  },
  {
    "commentText": "Goal number 1 get a porcupine"
  },
  {
    "commentText": "This is actually really healthy for him .\n~Cute little bugger ."
  },
  {
    "commentText": "Wish Teddy Bear would have bit or \"spiked\" that rotten bitch jamming the camera in the poor creature's face and exploiting him. Poor thing looked terrified at times and looked like it wanted to bite her. Animal cruelty must be stopped!!!!!"
  },
  {
    "commentText": "Who knew Ewoks were real? Another blow to George's creative legacy ;) Very cute video."
  },
  {
    "commentText": "Cute. However, it is obvious that Teddy makes the most sounds when you put the camera in his face. That's because he's annoyed. His natural reaction is to protect his food from being taken from him, which he thinks you are going to do. Like Peter Adams said below, those are at least partly warning sounds.\n\nI would hate to think you kept putting the camera closer to Teddy just to get him to make noise thinking that it sounds cute so you could get lots of people to \"like\" your video."
  },
  {
    "commentText": "That voice kills me"
  },
  {
    "commentText": "it's a pokemon!"
  },
  {
    "commentText": "1:53\nTeddy: \"Hey hey FUCK OFF!\"\nXD"
  },
  {
    "commentText": "I really hear Teddy saying......my, my, my, pumpkin, or  pumpkin pie!   The rest is Teddy's verbal expressions are of happiness.   And, his human loves it too!  Are porcupines, like, very smart?  Or, Is Teddy a freak?   ;)"
  },
  {
    "commentText": "He reminds me of a Pikachu."
  },
  {
    "commentText": "FYI:  If they swallow the seeds and poop them out, it can grow pumpkins next year."
  },
  {
    "commentText": "Oh my goodness, how cute!  Is it normal for them to make this noise?  Do they talk?"
  },
  {
    "commentText": "Hahahaha im stoned as a mother fucka and seeing this make it so much better XD"
  },
  {
    "commentText": "This video was on top 20 funniest"
  },
  {
    "commentText": "WHAT KIND OF POKEMON IS THAT?"
  },
  {
    "commentText": "What a little cutie!"
  },
  {
    "commentText": "A year older and it's just that much cutier! :D"
  },
  {
    "commentText": "Wow, I didn't know porcupines made a noise, especially one like that!   Thank you for posting this."
  },
  {
    "commentText": "You guys should lend his voice to Disney or something lol."
  },
  {
    "commentText": "He's freaking adorable!"
  },
  {
    "commentText": "What a cute porcupine. I really enjoyed watching this video :)"
  },
  {
    "commentText": "Are you sure he's not making the noises because he's getting annoyed at the camera?"
  },
  {
    "commentText": "What a lovely little being! He made my day with his little monologue."
  },
  {
    "commentText": "so cool! i think teddy is ready for a nap. Sounds like he's actually saying \"good\" quite a bit into second half of video or i've lost it"
  },
  {
    "commentText": "A serial quiller"
  },
  {
    "commentText": "it sounds like a cartoon animal or pokemon"
  },
  {
    "commentText": "I want to hug him."
  },
  {
    "commentText": "cousin it!"
  },
  {
    "commentText": "+10 puercoespín lince de las sabanas top en taringa???"
  },
  {
    "commentText": "He is sooo cute!! Love his noises and his little face! Read the comments and some of you people are evil saying bad things about it! This is why I like animals better than people sometimes!"
  },
  {
    "commentText": "What r those made out of"
  },
  {
    "commentText": "Play this video for your dogs."
  },
  {
    "commentText": "Mas feliz que puercoespin comiendo calabazas"
  },
  {
    "commentText": "Sounds like the noise a Pokemon would make!"
  },
  {
    "commentText": "SO CUTE! I Never Even Knew Porcupines Could Even Talk."
  },
  {
    "commentText": "This begs the question, Teddy is adorable of course, but how do you pet him?"
  },
  {
    "commentText": "he sounds like cousin it from the adams family teddy is so cute from suzanne mason"
  },
  {
    "commentText": "It's so cute, it makes me sad no one can't pet him. :("
  },
  {
    "commentText": "Too cute to watch."
  },
  {
    "commentText": "I get the feeling the porcupine is saying \"back off\" not \"yum.\""
  },
  {
    "commentText": "awwwww~ he's too cute!!! awesome video~!!! thanks for sharing!!!"
  },
  {
    "commentText": "Damn. Those are some small pumpkins."
  },
  {
    "commentText": "Sounds like my annoying neighbors in animal crossing."
  },
  {
    "commentText": "Great, now I want a porcupine"
  },
  {
    "commentText": "does it really make those cute sounds?"
  },
  {
    "commentText": "Sounds like a Minion!"
  },
  {
    "commentText": "OMGoodness, is this for real, please I need to know or I won't be able to sleep."
  },
  {
    "commentText": "He sounds like an Ewok."
  },
  {
    "commentText": "Ha! Funny"
  },
  {
    "commentText": "Its like an Ewok"
  },
  {
    "commentText": "How can this video have 2 million views, when there are only 150,000 people in South Dakota?"
  },
  {
    "commentText": "can't tell if he's being cute or if he's saying STAY AWAY FROM MY PUMPKIN!"
  },
  {
    "commentText": "Sounds sort of like The Thing on Adam's Family tv show. I have a talking cat, but didn't know there were talking porcupines. Adorable!!!"
  },
  {
    "commentText": "So which Pokemon is that?"
  },
  {
    "commentText": "As a mod of /r/aww I definitely approve this fuzzy little gentlequill.\n\n~snoop doge, reddit prodigy and basement hero."
  },
  {
    "commentText": "I want a porcupine as a pet now."
  },
  {
    "commentText": "It's the cutest thing I have even seen xD"
  },
  {
    "commentText": "Cute, but those sound like warning sounds. \"Get away, this pumpkin is mine!\""
  },
  {
    "commentText": "Can you even safely pet a porcupine? ._."
  },
  {
    "commentText": "How would someone handle a porcupine?"
  },
  {
    "commentText": "YOUR TOO SLOW"
  },
  {
    "commentText": "Lord\nhe is absolutely losing his mind over that pumpkin"
  },
  {
    "commentText": "I've never seen anyone keep a porcupine as a pet before! Learn quill work! You have a constant supply!!!! I'm jealous"
  },
  {
    "commentText": "who the hell knew porcupines could sound THAT adorable.  I'm stunned."
  },
  {
    "commentText": "Looks like he's being territorial at certain points. Almost like a dog protecting its food. When she gets closer to him, he looks like he's lunging at her."
  },
  {
    "commentText": "Do porcupines always \"Yum, Yum\" when they eat or is he really, really enjoying that pumpkin?"
  },
  {
    "commentText": "LOVE!"
  },
  {
    "commentText": "OMG, that voice is the most adorable thing I've ever heard!!"
  },
  {
    "commentText": "I think Cousin It taught him how to speak"
  },
  {
    "commentText": "Pumpkin fed porcupine!  Mmmmmmmmmmmmmmmmmmmmm"
  },
  {
    "commentText": "I totally cannot get enough of this little guy he so adorable and the chatter as he eats just makes me laugh out loud thanks for another video keep them coming!!!!!"
  },
  {
    "commentText": "he loves his food, what a funny noise they make, its most unusual:)  my cat purrs when he eats, the only cat we ever had that did this:)"
  },
  {
    "commentText": "OH MY GOD"
  },
  {
    "commentText": "yea he can say pumpkin yes, if you implant somthing that makes him speak..which is fucking unrealistic."
  },
  {
    "commentText": "That's so adorable!"
  },
  {
    "commentText": "Feel like lettin my freak flag fly ..."
  },
  {
    "commentText": "this is cgi"
  },
  {
    "commentText": "That's exactly how I eat pumpkin pie."
  },
  {
    "commentText": "god that is scary"
  },
  {
    "commentText": "Demasiado bello"
  },
  {
    "commentText": "Sorta like R2D2 but less gay."
  },
  {
    "commentText": "I literally can't even right now.  It's voice...  So cute!"
  },
  {
    "commentText": "THANKS TUMBLR."
  },
  {
    "commentText": "He is cuter than any cartoon I ever saw ! If he wasn't a porcupine I'd squeeze him and kiss him!"
  },
  {
    "commentText": "Om nom nom!"
  },
  {
    "commentText": "Is he speaking Ewok? ;P"
  },
  {
    "commentText": "Oh so enjoyed this!!"
  },
  {
    "commentText": "Whoever disliked the cute porcupine needs to move to a remote island away from everyone else."
  },
  {
    "commentText": "I never knew porcupines made those noises! 😍 So cute!"
  },
  {
    "commentText": "“Good boy, Teddy.”\n\"Thanks!\""
  },
  {
    "commentText": "lol"
  },
  {
    "commentText": "Such a cute creature!! I want give him a pat, I want give him a hug, I want..... ahhhhhhhhh~ OUCH!!"
  },
  {
    "commentText": "Is that how they really sound?!"
  },
  {
    "commentText": "OMG!! I want him so bad,but my husband says im crazy.I think that is the most adorable little thing ."
  },
  {
    "commentText": "so cute"
  },
  {
    "commentText": "is that really his voice???"
  },
  {
    "commentText": "Is he really making those adorable sounds? is he a family pet? I am in awe over all of this cuteness. His favorite time of year is here, hope you get a ton more of baby pumpkins to gobble up Teddy :)"
  },
  {
    "commentText": "TOO MUCH CUTENESS FROM THE LITTLE GUY."
  },
  {
    "commentText": "This is quite awesome"
  },
  {
    "commentText": "so cute"
  },
  {
    "commentText": "How can people not like this? come on, it's so cute!!!! lol\nMy baby pretty much makes the same sounds when I feed her. lol"
  },
  {
    "commentText": "1:54 Flap flap! lol"
  },
  {
    "commentText": "So cute!"
  },
  {
    "commentText": "Super adorable!"
  },
  {
    "commentText": "I swear to god he said pumpkin \n\ncan you like.. pet him?"
  },
  {
    "commentText": "Too cute"
  },
  {
    "commentText": "Teddy!💓"
  },
  {
    "commentText": "Oh Lord, the cutest thing, ever!!! SO PRECIOUS!!! ~ <3"
  },
  {
    "commentText": "I had a smile plastered on my face the whole time I was watching Teddy eat his pumpkins. Actually, he made me laugh. He is so stinkin' cute; I love him!!!!"
  },
  {
    "commentText": "00:16 \"That tastes Nice\""
  },
  {
    "commentText": "omg he sounds like a little cartoon character XD"
  },
  {
    "commentText": "I love this video...Adorable!"
  },
  {
    "commentText": "Too much! I love him!"
  },
  {
    "commentText": "Watching Teddy eat pumpkin is a mood elevating experience. Teddy The Adorable."
  },
  {
    "commentText": "I love this video!"
  },
  {
    "commentText": "I've never wanted to cuddle a spiny creature more in my entire life."
  },
  {
    "commentText": "iM GONNA CRY HE'S SO CUTE"
  },
  {
    "commentText": "So cute"
  },
  {
    "commentText": "I want one!"
  },
  {
    "commentText": "Haha it' so awesome"
  },
  {
    "commentText": "omg this little guy can't be more cute! I Love the sounds he make <3"
  },
  {
    "commentText": "omg this little guy can't be more cute! I Love the sounds he make <3"
  },
  {
    "commentText": "So cute. I love to hear the sounds the baby makes."
  },
  {
    "commentText": "1"
  },
  {
    "commentText": "This porcupine watches too much Alvin & the Chipmunks"
  },
  {
    "commentText": "\"You're welcome!\" lol! God he's so cute."
  },
  {
    "commentText": "This has to be the cutest thing ive ever seen"
  },
  {
    "commentText": "You want the cute? YOU CAN'T HANDLE THE CUTE!"
  },
  {
    "commentText": "So Cute. Sounds like \" Cousin It \" from the Adams Family.....the original show."
  },
  {
    "commentText": "He really talks.\n\n\"Pumpkin\" etc..like..not so.."
  },
  {
    "commentText": "This sounds exactly like an ewok"
  },
  {
    "commentText": "This is why I am a libertarian lol"
  },
  {
    "commentText": "Oh dear, don't let \"Cute Things Exploding\" see this! @CuteThingsExploding"
  },
  {
    "commentText": "I just want to hug him ... Or not."
  },
  {
    "commentText": "I think it like pumpkins! :D hehe\nNext yt search...talking porcupine :) lol"
  },
  {
    "commentText": "This is why i love internets."
  },
  {
    "commentText": "On AFV they had the \"Name That Sound\" thing, and my family was so confused what it was, and I was like \"PORCUPINE!!\" and I got it right, and everyone looked at me like \"What? How did you know?\" and I said I watched this vid."
  },
  {
    "commentText": "sooooooo cute! and the sounds <3"
  },
  {
    "commentText": "Here's some proof for the people who thought Teddy was only 'talking' because she was tormenting him and making like she was taking his food. The whole time, the only time her hand is seen near a pumpkin is when she's putting down a completely different pumpkin next to him, and Teddy's talking the entire time."
  },
  {
    "commentText": "Oh my god he's too cute"
  },
  {
    "commentText": "Such a cutie!!"
  },
  {
    "commentText": "I'm addicted...I keep coming back to watch this cute little guy.  How freaking adorable!!!"
  },
  {
    "commentText": "Teddy bear sounds like he is saying \"it's good, it's good!\""
  },
  {
    "commentText": "I never knew that they were so chatty! :3 Sooo cute!"
  },
  {
    "commentText": "super cute!"
  },
  {
    "commentText": "Teddy is adorable!"
  },
  {
    "commentText": "Is Teddy just talking or is he trying to warn you away, thinking you'll steal his pumpkin?"
  },
  {
    "commentText": "I think he's saying, \"Get that camera out of my face and stop with that vomit-inducing narrative!\"."
  },
  {
    "commentText": "do the spines hurt ever?"
  },
  {
    "commentText": "wow..lol how do you pat him/her?"
  },
  {
    "commentText": "Is it just me,or is that porcupine sounded like a girl......."
  },
  {
    "commentText": "Those noises he made while eating the pumpkin were incredibly adorable. Excuse me while I die of cuteness."
  },
  {
    "commentText": "Very cute, but um who had a pet porcupine??"
  },
  {
    "commentText": "1:25 i swear he said that was fun"
  },
  {
    "commentText": "OMG Adorable! :'DD"
  },
  {
    "commentText": "so cute!"
  },
  {
    "commentText": "Photoshopped."
  },
  {
    "commentText": "May I ask you a question?\nOnly this (or a few)porcipine is able to do those funny, cute noises? Or it's common among porcupines?\n(Sorry for bad English)"
  },
  {
    "commentText": "OMG...thank you so much for sharing your precious porcupine with us...he is the cutest little guy...I had no idea they made all those noises!! God bless!!"
  },
  {
    "commentText": "' Mogwai ! '  :)"
  },
  {
    "commentText": "omg i want one"
  },
  {
    "commentText": "Teddy is to cute man."
  },
  {
    "commentText": "Teddy Bear sounds so much like Cousin Itt in \"The Addams Family\"\nHe's so hilarious!"
  },
  {
    "commentText": "I need to go fight some bikers to regain my manhood."
  },
  {
    "commentText": "it sounds like an ewok :D  this thing is just too adorable for words :)"
  },
  {
    "commentText": "That is the cutest thing in the world!!!"
  },
  {
    "commentText": "Teddy is so adorable !"
  },
  {
    "commentText": "My heart exploded from all the cuteness! AHHH <3 !!!!! :D"
  },
  {
    "commentText": "1:25 havin' fun"
  },
  {
    "commentText": "if only she could shut up so i could heat the porcupine"
  },
  {
    "commentText": "How do you pet a porcupine?"
  },
  {
    "commentText": "Oh my god this is so adorable."
  },
  {
    "commentText": "So cute.  I just want to cuddle with him... :P"
  },
  {
    "commentText": "Cuteness overload"
  },
  {
    "commentText": "I died from the adorableness"
  },
  {
    "commentText": "OM NOMNOM!!!! OwO"
  },
  {
    "commentText": "Squee! This is so cute! Teddy Bear sure loves pumpkins! I could actually hear him saying, \"Yum, good pumpkin\", \"Nom Nom Nom Nom\",  and so many other words. He's such a smart porcupine!"
  },
  {
    "commentText": "Aw how endearing. TEDDY! So cute and he REALLY likes pumpkin! So sweet."
  },
  {
    "commentText": "That is so stinking cute and adorable....... Thanks!"
  },
  {
    "commentText": "Man, it just sucks that I used to kill these little shits with around my house with rocks and sticks when I was a kid ;/"
  },
  {
    "commentText": "That is so Cute, I luv his little voice n noises he makes... Thxx for sharing this adorable little guy  :)"
  },
  {
    "commentText": "My gosh! how cute he is. I love the sounds he makes... I was smiling the whole time I was watching him. Thank you for sharing!"
  },
  {
    "commentText": "real life ewok"
  },
  {
    "commentText": "Teddy Bear has some Ewok in him. Darling - beyond cute!"
  },
  {
    "commentText": "It sounds like he's saying thanks."
  },
  {
    "commentText": "Don't speak with your mouth full - LOL!!!"
  },
  {
    "commentText": "Who the fuck owns one as a pet here where I live there pests and we kill them"
  },
  {
    "commentText": "Who the fuck owns one as a pet here where I live there pests and we kill them"
  },
  {
    "commentText": "I love the lady that's talking to Teddy. She makes the video a lot more entertaining."
  },
  {
    "commentText": "The cute is reaching critical overload!"
  },
  {
    "commentText": "So so cute he made ny day when i think about this cute little guy i smile hes amazing"
  },
  {
    "commentText": "OMG, that is so cute!  I could listen to Teddy all day long!  It really sounds like he's talking!"
  },
  {
    "commentText": "too bad you cant pet him"
  },
  {
    "commentText": "I'm in AWE of your dedication....what a sweet thing to let people see what a porcupine can be without being in the middle of a road somewhere. They are essential to nature everywhere."
  },
  {
    "commentText": "That is beyond adorable!"
  },
  {
    "commentText": "This may be the cutest thing I've ever seen!"
  },
  {
    "commentText": "103 people got smacked in the face by a porcupine's tail (ouch)"
  },
  {
    "commentText": "omgggg how do you stop yourself from hugging the crap out of him!"
  },
  {
    "commentText": "oh my god this ."
  },
  {
    "commentText": "OMGOSH. SO cuuuutteeeeeeee"
  },
  {
    "commentText": "reminds me of cousin itt from addams family."
  },
  {
    "commentText": "I didn't know porcupines were so adorable. Listen to those adorable little noises!"
  },
  {
    "commentText": "Where is Bob Ross when you need him . . ."
  },
  {
    "commentText": "es una ternura escucharlo muy adorable ♥♥♥"
  },
  {
    "commentText": "OMG...I need one...lol..."
  },
  {
    "commentText": "Kill it before it lays eggs!"
  },
  {
    "commentText": "So that's what a porcupine looks like! I've always wondered if their anything like an echidna."
  },
  {
    "commentText": "Sounds like cousin It from the Adams Family."
  },
  {
    "commentText": "So cute.   LOL.   \nLove him ........ (ツ)"
  },
  {
    "commentText": "Why is \"TEd\" in captivity? CAn't he exist in the wild?"
  },
  {
    "commentText": "This must be where the japanese got the idea for pikachu's voice"
  },
  {
    "commentText": "@1:24\"so much fun\"!!"
  },
  {
    "commentText": "sweetest thing of all time!!!"
  },
  {
    "commentText": "It must be torture to have a pet THAT cute and not be able to give him a huge hug!"
  },
  {
    "commentText": "SO CUTE!!!!!"
  },
  {
    "commentText": "He sounds like Cousin It from The Addams Family."
  },
  {
    "commentText": "Oh, he is adorable!  Bless every one of his l'il prickles!  Lucky chap; he's deservedly loved. x"
  },
  {
    "commentText": "Adorkable."
  },
  {
    "commentText": "OMG, the sounds are so cute!"
  },
  {
    "commentText": "HHHHNNNNGGGGG!!!!"
  },
  {
    "commentText": "It sounds like its talking So cute <3 <3 <3"
  },
  {
    "commentText": "is that the porcupine squeaking is is that a voice over???"
  },
  {
    "commentText": "awwwwww <3"
  },
  {
    "commentText": "Why TB? Why?"
  },
  {
    "commentText": "porcupines are very cute and very nice....well if your nice to them and obviously dont fuck with a wild one but if you feed wild ones and pose no threat they generally are really nice just do not piss one off"
  },
  {
    "commentText": "It's like it's saying \"I like it\" in a high pitched voice, so damn cute! :D"
  },
  {
    "commentText": "OMG so darling!"
  },
  {
    "commentText": "if everyone at war watched this, world peace would happen"
  },
  {
    "commentText": "Adorable!"
  },
  {
    "commentText": "Where the Ewok language came from in Star Wars..."
  },
  {
    "commentText": "Oh adorable; but I don't know if porcupines could be a pet. But cute though."
  },
  {
    "commentText": "Fake. It's a sock puppet and a guy on helium. ;)"
  },
  {
    "commentText": "It does sound like he's talking :D"
  },
  {
    "commentText": "96 people have no soul."
  },
  {
    "commentText": "I swear, around 1:23, he said, \"This is good.\" LOL What a cutie."
  },
  {
    "commentText": "\"What is it Teddy? Pumpkin? Can you say pumpkin?\" \"Right, Pumpkin!\""
  },
  {
    "commentText": "ふわふわ ふわふわふわふわ"
  },
  {
    "commentText": "so cute!!!!!"
  },
  {
    "commentText": "Adorable"
  },
  {
    "commentText": "i hope she treats people as nice as she does her pets. animals are savages and humans have the possibility for moral depth and compassion. i don't get why the chowing down or everything animals do is automatically \"cute\" and people can treat their pets so well and then turn around and hate and treat actual human beings like sh**. such wrong teaching/ideology."
  },
  {
    "commentText": "This can NOT be real."
  },
  {
    "commentText": "So now I need a porcupine. And a pumpkin patch."
  },
  {
    "commentText": "This made my day, hats off to Teddy the Porcupine enjoy those pumpkins buddy!!"
  },
  {
    "commentText": "It looks like it´s a `food-defending ´ chatter.. he will probably stop if you move away."
  },
  {
    "commentText": "He sounds like a cross between and Ewok and Eric Cartman"
  },
  {
    "commentText": "Oh, he is ADORABLE!!!!!"
  },
  {
    "commentText": "Yo-ho...? A-hoy!"
  },
  {
    "commentText": "Ahaha so precious! It's like he jumped right out of a Disney movie. :D"
  },
  {
    "commentText": "He literally sounds like a Happy Tree Friend."
  },
  {
    "commentText": "He literally sounds like a Happy Tree Friend."
  },
  {
    "commentText": "AWE!!! Porcupines just became my favorite animal! xD So CUTE!"
  },
  {
    "commentText": "Cousin It!"
  },
  {
    "commentText": "Which zoo?"
  },
  {
    "commentText": "When's the next episode of this little guy coming? I'd love something new!"
  },
  {
    "commentText": "i could have sworn i heard him say its a pumpkin,of course its good"
  },
  {
    "commentText": "OMG he is so cute!!!!"
  },
  {
    "commentText": "He so reminds me of Cousin It!"
  },
  {
    "commentText": "Ummm what the fuck.... this is not cute at ALL. This practically disturbs me I cant even watch the whole thing with the \"rheaheahhe ehrrrehaerah\" shit WTF"
  },
  {
    "commentText": "Now I know who did the voice for Coz It on the Addams Family."
  },
  {
    "commentText": "Teddy Bear is a cute little thing. He sounds like and Ewok from Star Wars. :-)"
  },
  {
    "commentText": "imagine a bunch of them all making noise all at the same time"
  },
  {
    "commentText": "Rodents are freakin' funny creatures."
  },
  {
    "commentText": "This reminds me of a kitty we found near a summer house in Turkey, meowing loud calling for its mother. Kept meowing while drinking the milk my mom left, the result was hilariously adorable."
  },
  {
    "commentText": "He sounds like cousin It from the Addams family sometimes."
  },
  {
    "commentText": "Love Teddy's eating, especially corn of cob.  Noticed he was looking at the camera more than usual."
  },
  {
    "commentText": "I would swear right around the 2:40 mark, after she asked \"Pretty good stuff?\" he went \"Hmmm..not bad.\"\n\nBRB dead of cute"
  },
  {
    "commentText": "Is it speaking in Animal Crossing tongue?"
  },
  {
    "commentText": "i would name it pumkincorn"
  },
  {
    "commentText": "So kawaii"
  },
  {
    "commentText": "this makes me so happy"
  },
  {
    "commentText": "That's one weird looking cat..."
  },
  {
    "commentText": "I swear these sound like real conversations between an adult and a young child.\n\n0:35\n\nKeeper: Aw. What is it Teddy?\n\nTeddy Bear: Uh... uh...\n\nKeeper: Pumpkin?\n\nTeddy Bear: Yes! It's a pumpkin!\n\nKeeper: Can you say pumpkin?\n\nTeddy Bear: Uh huh, pumpkin! Yum yum yum. Yes, pumpkin!"
  },
  {
    "commentText": "Zo schattig!!!"
  },
  {
    "commentText": "Too cute, I can't handle it"
  },
  {
    "commentText": "happy noises ^_^"
  },
  {
    "commentText": "Красава есть жи."
  },
  {
    "commentText": "This is the best thing on earth i'll take 14"
  },
  {
    "commentText": "This is the best thing on earth i'll take 14"
  },
  {
    "commentText": "He seems rather grumpy."
  },
  {
    "commentText": "Looks like a critter! Ever see the film Critters?"
  },
  {
    "commentText": "Забавный или забавная :)"
  },
  {
    "commentText": "cute name"
  },
  {
    "commentText": "Cutest creature ever :)"
  },
  {
    "commentText": "This little guy is extremely adorable!!! I'm curious, are his quills sharp still, or have they been smoothed out at the vet's or something?"
  },
  {
    "commentText": "@1:24 I am pretty sure he says \"what da fuck?\""
  },
  {
    "commentText": "OH MY GOOOOODDDDDD\nHE'S GIVING ME CAVITIES"
  },
  {
    "commentText": "dam you can at 0.54 you can clearly hear him sayin, ( I like it )"
  },
  {
    "commentText": "LOL he sounds like He's sayin I like it, have a listen before 0.56"
  },
  {
    "commentText": "He almost sounds like he's saying omnomnom. XD"
  },
  {
    "commentText": "What the actual fuck did I just watch?"
  },
  {
    "commentText": "Its shaymin from the pokemon movie"
  },
  {
    "commentText": "Oh god this is too cute I'm gonna vomit rainbows."
  },
  {
    "commentText": "I can´t with my life, OMG is so cute -"
  },
  {
    "commentText": "It sounds like Ewok LOL so cute"
  },
  {
    "commentText": "I swear I heard him say pumpkin.. TWICE!!!"
  },
  {
    "commentText": "He is so cute \nIs he your pet?"
  },
  {
    "commentText": "Never heard a porcupine before, so stinking cute, sweet little fellow. Thanks for the video! 😊👍"
  },
  {
    "commentText": "Not necessarily better than pumpkin pie, but definitely better for his teeth!"
  },
  {
    "commentText": "Sounds like \"Cousin IT\""
  },
  {
    "commentText": "omg so cute"
  },
  {
    "commentText": "D'awew!"
  },
  {
    "commentText": "I swear to bird Jesus that he says \"I like it!\" at about 0:55..."
  },
  {
    "commentText": "this is just way too cute for words! what a darling!!!! :)"
  },
  {
    "commentText": "I love Teddy!"
  },
  {
    "commentText": ":O :D THIS IS SO ADOREABLE!!!"
  },
  {
    "commentText": "porcupines are so dumb i want ten of them"
  },
  {
    "commentText": "Am I the only one hearing the porcupine say: Ah yummy, yummy when he first started eating."
  },
  {
    "commentText": "What the heck I never knew porcupines made noises let alone cute little nasally squeaks. Didn't knew they enjoy pumpkins either :o"
  },
  {
    "commentText": "Cute.... I sound exactly like that when I eat apples. MY APPLES!"
  },
  {
    "commentText": "To me it kinda looked like he's annoyed by the camera... But its hard to say."
  },
  {
    "commentText": "I love this wee chap x"
  },
  {
    "commentText": "So cute!"
  },
  {
    "commentText": "I want a porcupine right now!!"
  },
  {
    "commentText": "pikachu!"
  },
  {
    "commentText": "awwww"
  },
  {
    "commentText": "I make similar noises while eating..."
  },
  {
    "commentText": "My little dog sometimes makes somewhat similar sounds (he is not as \"talkative\" though), maybe because he is approximately the same size, except being a dog, hes doesn't make them while eating, but when he smells a \"girl\" dog."
  },
  {
    "commentText": "prickly on the outside, soft on the inside hahaha so cute"
  },
  {
    "commentText": "It's amazing to me. This porcupine is saying, 'pumpkin',. I swear."
  },
  {
    "commentText": "Cute funny little guy"
  },
  {
    "commentText": "its like he is saying words sometimes"
  },
  {
    "commentText": "Yes this is cute, but do people realize that the cute sounds and movements stem from this small animal feeling threatened by having a camera stuck in his face while he's eating? It is called \"resource defending behavior\" and is a sign is distress in the animal exhibiting it. All these cute videos are the direct result of the person filming essentially terrorizing this animal while he's trying to eat."
  },
  {
    "commentText": "Get back!  That's MINE!!!"
  },
  {
    "commentText": "<3 Teddy I love you!!!! <3"
  },
  {
    "commentText": "I swear it sounds like he's say \"hey, get back\" when she gets to close!"
  },
  {
    "commentText": "Is that really what they sound like? That's not a voice over?"
  },
  {
    "commentText": "Wait they actually make noises like that? This makes me so happy!"
  },
  {
    "commentText": "Do all porcupines \"talk\" or just this one?"
  },
  {
    "commentText": "I never knew a porcupine sounded like this!"
  },
  {
    "commentText": "I hear \"This is good\" \"Num num num\" \"Pumpkin\" and \"It's good\" \"Like like like\""
  },
  {
    "commentText": "Please don't overfeed this lovely creature! Obesity is bad for animals too!!!!"
  },
  {
    "commentText": "CUTE!!"
  },
  {
    "commentText": "made my day seeing and hearing this little guy"
  },
  {
    "commentText": "Did he tell her to get back? LMFAO!!!"
  },
  {
    "commentText": "Hah 2:39 not bad <3"
  },
  {
    "commentText": "He lover's those pumpkins!! I never heard them talk before..."
  },
  {
    "commentText": "at 2:06 he clearly says \"GOOD!\" haha!"
  },
  {
    "commentText": "Dafuq is that pokemon? I want one!"
  },
  {
    "commentText": "at 0.57 bear says quite nice!!"
  },
  {
    "commentText": "Literally crying. He is way too CUTE!"
  },
  {
    "commentText": "The fuck....are they supposed to make that sound?"
  },
  {
    "commentText": "talkative lil guy"
  },
  {
    "commentText": "god bless for all the love you give to teddy,"
  },
  {
    "commentText": "I heard that zinc is good for your sex-drive and pumpkin seeds are full of zinc. There's gonna be one randy porcupine running around soon. :)"
  },
  {
    "commentText": "awwww it said i dont know loL!"
  },
  {
    "commentText": "so annoying lmao"
  },
  {
    "commentText": "Such a sweet precious little guy. So many meaningful intonations . . . beautiful . . . he's talking to you! If only we would all listen and respond 100% to life forms, as you have done"
  },
  {
    "commentText": "Wau! He speaks. :D My chinchila rearlly speaks. :("
  },
  {
    "commentText": "I am waiting for his antennas to pop out ! lol !"
  },
  {
    "commentText": "Is teddy an alien disguised has a porcupine ?"
  },
  {
    "commentText": "cute animal videos are killing me"
  },
  {
    "commentText": "How utterly adorable!"
  },
  {
    "commentText": "OMG I didn't think those noises were real, sooooooo cute!!"
  },
  {
    "commentText": "Sounds like he is \"talking\" so much because he feels the person is too intrusive when he is eating. I get the feeling he might lunge out and bite the lady suddenly."
  },
  {
    "commentText": "How do you not get poked?"
  },
  {
    "commentText": "oh my god its like a fucking grimlin. Kawaii!!"
  },
  {
    "commentText": "did he eat that whole pot of pumpkins?"
  },
  {
    "commentText": "Tremendo banquete"
  },
  {
    "commentText": "I have never heard what noises a porcupine makes almost sounds like they are talking so adorable this fella is you just want to squeeze him but that might be a mistake love your videos of this rare pet"
  },
  {
    "commentText": "What a greedy little glutinous porcupine.. noises are pretty cute though."
  },
  {
    "commentText": "That is the most epic thing EVER! He just waddles around happy as can be, eatin' up pumpkins, chillin out, and talking, AMAZING!"
  },
  {
    "commentText": "his cartoon voice is the best ever"
  },
  {
    "commentText": "Back to Narnia you go!"
  },
  {
    "commentText": "Nice porcupine"
  },
  {
    "commentText": "He's speaking chipmunk!"
  },
  {
    "commentText": "hes so adorable. can u actually pat him with gloves on? can those quills be trimmed down so he;d be safe to pat and hold? whats his real diet like besides the treats?"
  },
  {
    "commentText": "If I heard something making noises like that in the dark I would freak out. lol"
  },
  {
    "commentText": "\"I like I like like like it\" so cute!!! lol"
  },
  {
    "commentText": "you have to admit he is smart and cute and if i had him i would make him my house pet, I think he that damn cute :)"
  },
  {
    "commentText": "They should have named him Kenny, and all the noises would make sense."
  },
  {
    "commentText": "They are truly adorable :) ...If you are in the big north woods, just don't forget and leave your Ax out where they can get to it, or you will need a new handle."
  },
  {
    "commentText": "As an animated Porcupine fan, I have to say this is absolutely adorable."
  },
  {
    "commentText": "i love how chatty he is ^^"
  },
  {
    "commentText": "Reminds me of Cousin ITT for real!"
  },
  {
    "commentText": "Always love when a new Teddy video appears. What about a Christmas video for 2013?"
  },
  {
    "commentText": "Worth watching ... over and over... what a sweetheart and well taken care of too!"
  },
  {
    "commentText": "Is that the sound it actually makes???"
  },
  {
    "commentText": "im here because of sparknotes. i want this porcupine.."
  },
  {
    "commentText": "Dis iz mai punkinz u kant havz itz!"
  },
  {
    "commentText": "He sound like one of the characters from the Marion saga universe. Any way it's cute"
  },
  {
    "commentText": "I WANT ONE"
  },
  {
    "commentText": "2:36 I don't know, not bad"
  },
  {
    "commentText": "oh my goodness. this is outstanding."
  },
  {
    "commentText": "is it actually talking?"
  },
  {
    "commentText": "Awwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww"
  },
  {
    "commentText": "so were the spikes removed?\nwhere did you get the porcupine?"
  },
  {
    "commentText": "I didn't realize how cute porcupines sounded awwwwe!!!!"
  },
  {
    "commentText": "BEST animal video on youtube hands down!!!"
  },
  {
    "commentText": "Awwwww"
  },
  {
    "commentText": "it sounds like he's saying \"ohh yeah\" haha (:"
  },
  {
    "commentText": "I haven't had a girlfriend in five years. My heart has turned to stone and I have built a wall around it. But this....this..just FUCKING ADORABLE!"
  },
  {
    "commentText": "OMG this is adorable"
  },
  {
    "commentText": "You're allowed to keep a Porcupine as a pet??"
  },
  {
    "commentText": "This is fantastic and adorable. Oh wow."
  },
  {
    "commentText": "i hear him say; \"its quite good. I like it.\" at some points. hehe."
  },
  {
    "commentText": "is this the cutest thing ever or what? better than cats!"
  },
  {
    "commentText": "I want what he's having"
  },
  {
    "commentText": "I just want to HUG Teddy...but I know that won't end well for me! He is ADORABLE! <3"
  },
  {
    "commentText": "If you asked a biologist why porcupines evolved quills, they would likely tell you it was to prevent them from being eaten by other animals. However, porcupines clearly evolved them to prevent the species from being cuddled to death by humans who find them unbelievably adorable."
  },
  {
    "commentText": "He can probably type!!"
  },
  {
    "commentText": "God damn it Ross"
  },
  {
    "commentText": "Oh god I want a porcupine now."
  },
  {
    "commentText": "That's awesome!"
  },
  {
    "commentText": "He's talking I swear"
  },
  {
    "commentText": "adorable!"
  },
  {
    "commentText": "i thought those pumpkins were plastic"
  },
  {
    "commentText": "Omg!!! ♥"
  },
  {
    "commentText": "What's that?  GOOD !!!"
  },
  {
    "commentText": "omg I'm convinced porcupine are pokemons"
  },
  {
    "commentText": "that's awesome"
  },
  {
    "commentText": "I'm totally in LOVE with Teddy Bear!  He's amazing! More Teddy, please!!!"
  },
  {
    "commentText": "Tak tu zvieza jest"
  },
  {
    "commentText": "Seriously the cutest thing ever. Hands down."
  },
  {
    "commentText": "I want what he's having"
  },
  {
    "commentText": "I am so in love with this little guy!  I love his little noises that he makes when he's munching on something he likes.  I could listen to him eat and \"talk\" all day lol. So adorable ;-)"
  },
  {
    "commentText": "HOW IS THIS CUTENESS POSSIBLEEE"
  },
  {
    "commentText": "These are the cutest sounds!"
  },
  {
    "commentText": "PAMPKIINZ!"
  },
  {
    "commentText": "Holy Shit...when it made noises...I literally said \"The fuck\" ..weirdest creepiest shit"
  },
  {
    "commentText": "Never heard Porcupine noises before... this is uber-cute."
  },
  {
    "commentText": "Such a sweet baby!! > 3 <"
  },
  {
    "commentText": "I swear I hear him saying \"this is good\" at some point lol"
  },
  {
    "commentText": "i love listening to porcupine's"
  },
  {
    "commentText": "Super adorable!"
  },
  {
    "commentText": "aahhhhh he is the cutest thing ever!!!!"
  },
  {
    "commentText": "Pokemon"
  },
  {
    "commentText": "awww Teddy!!!"
  },
  {
    "commentText": "Not what I was expecting. Cuteness overload!"
  },
  {
    "commentText": "MY god i need a porcupine!!!"
  },
  {
    "commentText": "I ♥ Teddy Bear"
  },
  {
    "commentText": "And the more I watch it, the cuter it is."
  },
  {
    "commentText": "i didn't realize they squealed!! eeeeeee!"
  },
  {
    "commentText": "Love this part of you tube! He's awesome :D"
  },
  {
    "commentText": "I WANT TO HUG IT BUT IT WILL SPEAR MY FACE!.....AH HELL I'D DO IT ANYWAY!!!"
  },
  {
    "commentText": "Awwwwww\n\ngoes into the corner to cry for to much cuteness"
  },
  {
    "commentText": "i want to hug this little sweet baby porcupine awwwwwwwww"
  },
  {
    "commentText": "that's the most adorable thing i've ever seen"
  },
  {
    "commentText": "I've been laughing my ass off at that porcupine, do they really make those noises??"
  },
  {
    "commentText": "CUTEST THING EVER"
  },
  {
    "commentText": "He sounds ljke a pokemon omg"
  },
  {
    "commentText": "POKEMON!"
  },
  {
    "commentText": "Omg"
  },
  {
    "commentText": "This is my favorite video ever.  :D"
  },
  {
    "commentText": "Awesome video!"
  },
  {
    "commentText": "i can't handle this"
  },
  {
    "commentText": "The lady who is speaking should narrate children's stories. Her voice is comforting, kind, and soothing."
  },
  {
    "commentText": "THE level of cuteness is unbearable."
  },
  {
    "commentText": "THE level of cuteness is unbearable."
  },
  {
    "commentText": "cute cute cute"
  },
  {
    "commentText": "I gotta see this little guy every few days to get my giggle fix ... ahhhh, that's way better. Love you Teddy Bear"
  },
  {
    "commentText": "I didn't know Porcupines could talk?"
  },
  {
    "commentText": "I think we just found a porcupine who is so enhusiastic about eating pumkins that he made me say WTF."
  },
  {
    "commentText": "I can't get enough of this little guy! He can Talk!!!"
  },
  {
    "commentText": "He sounds like one of those characters from Animal Crossing!"
  },
  {
    "commentText": "oh my goodness. oh my goodness. awwwwww."
  },
  {
    "commentText": "I am in love with this porcupine"
  },
  {
    "commentText": "I'm guessing he doesn't let you pet him ;)"
  },
  {
    "commentText": "Don't make noise eating, that is rude teddy!"
  },
  {
    "commentText": "IT'S AN EWOK!!"
  },
  {
    "commentText": "Question: does he have quills/spines? It's be hard to keep it as a pet if he did."
  },
  {
    "commentText": "What. The. Actual. I can't believe I just sat here and watched this. Wow."
  },
  {
    "commentText": "SOOOOO CUTE"
  },
  {
    "commentText": "It sound like he is speaking chinese or something"
  },
  {
    "commentText": "I heard the 'wtf' @ 1:25 as was mentioned below, lol."
  },
  {
    "commentText": "Ewok? omg this is too cute!"
  },
  {
    "commentText": "02:33 He's like : \" May I eat the second one now? Ah ,first eating this!\""
  },
  {
    "commentText": "I'm sensing a little food aggression here."
  },
  {
    "commentText": "This made my day along with Teddy's other videos! So adorable!!!"
  },
  {
    "commentText": "That brightened my morning...love it!"
  },
  {
    "commentText": "dirty mouth little guy"
  },
  {
    "commentText": "He say \"right\"  XD"
  },
  {
    "commentText": "Ho, hi nigga! :) 0:12"
  },
  {
    "commentText": "It sounds like he's saying, \"good\" in several spots. :)"
  },
  {
    "commentText": "YOU EVIL PERSON!!!!! \n\nLET SONIC RUN!!!! FREE!!!!!!!!!!"
  },
  {
    "commentText": "be still, my heart."
  },
  {
    "commentText": "I THINK I NOW WANT A PORCUPINE"
  },
  {
    "commentText": "2:14\n- Thanks.\n- You are welcome. ^^"
  },
  {
    "commentText": "Teddy Bear sounds like Cousin It from the Addams Family."
  },
  {
    "commentText": "He said \"Pumpkin\" at about 19 seconds. I'm glad you brought out another Teddy Bear video thank you so much , I'm glad he's doing well and still talking :)"
  },
  {
    "commentText": "are these aggressive sounds or just general porcupine chatter? id be scared lol"
  },
  {
    "commentText": "Cute"
  },
  {
    "commentText": "Es un perro xD"
  },
  {
    "commentText": "Damnit Ross"
  },
  {
    "commentText": "HE SOUNDS LIKE COUSIN ITT!!!!"
  },
  {
    "commentText": "Aaawwww its looks so nice, I want one! :) (a pumpkin not a porcupine, just to clear up any confusion)"
  },
  {
    "commentText": "Why does something you can't cuddle have to be so cute????"
  },
  {
    "commentText": "he's sooooo cute; is it typical for porcupines to vocalize this much?"
  },
  {
    "commentText": "Squeee!"
  },
  {
    "commentText": "OUCH MY HEART"
  },
  {
    "commentText": "I STARTED CRYING MY FEELS CAN'T HANDLE WHY"
  },
  {
    "commentText": "This is the cutest thing ever. Instant Joy. Thank you!"
  },
  {
    "commentText": "To jest URSON, a nie jeżozwierz. -.- Ursony są krewniakami jeżozwierzy, ale wbrew pozorom, bardzo dalekimi. Ursony w przeciwieństwie do jeżozwierzy utraciły wiele cech gryzoni i obecnie trwa spór czy nadal je do nich zaliczać."
  },
  {
    "commentText": "it sounds like a pokemon"
  },
  {
    "commentText": "Zooniversity is a travelling wildlife company that teaches people about animals. They are literally a Zoo University. I'm sure they know what the sound means and what they're doing."
  },
  {
    "commentText": "klasyka Polskiego kina : )"
  },
  {
    "commentText": "Wszystko jedno, co to było, skoro już tego nie ma."
  },
  {
    "commentText": "You need to see a psychologist then."
  },
  {
    "commentText": "Jeżozwierza .. Takiego.. Dużego Jeża"
  },
  {
    "commentText": "That was prob understood by many that watched..... the viewers are just saying he is precious.  \")"
  },
  {
    "commentText": "To Precious..... Thanks for making my morning.  :)"
  },
  {
    "commentText": "Boy is he a cutie.\nIs this a pet?"
  },
  {
    "commentText": "omfg, i just melted"
  },
  {
    "commentText": "Am I the only one slightly terrified?"
  },
  {
    "commentText": "Wow I never knew porcupines could sound like puppies! :D SOOOO cute!"
  },
  {
    "commentText": "HE SOUNDS LIKE A POKÉMANZ XD"
  },
  {
    "commentText": "Unmm.  Sorry ta burst the bubble, but the vocalists toons are a natuRal reaction if an animal distressed and worried that the other animal may take its food away. Notice how every time the other animal speaks it vocalizes? Or how every time the itber animals camera comes close the porcupine slightly lunges? duh"
  },
  {
    "commentText": "Is that an aggressive sound or?"
  },
  {
    "commentText": "fucking hell"
  },
  {
    "commentText": "Kind of reminds me of a giant guinea pig only covered in murderous spikes. :''')"
  },
  {
    "commentText": "this is so cute and funny at the same time!!!!!!! XD"
  },
  {
    "commentText": "SOOOO CUUUUUTE! ♥♥♥♥♥!!!!"
  },
  {
    "commentText": "I HAD TO PAUSE THE VIDEO SO I COULD SCREAM."
  },
  {
    "commentText": "OMG that's so adorable! :3"
  },
  {
    "commentText": "Is that for REAL!!"
  },
  {
    "commentText": "Good grief! Didn't even know they MADE a sound!"
  },
  {
    "commentText": "fuck this is adorable"
  },
  {
    "commentText": "then right after that, it said, \"this is fun!\""
  },
  {
    "commentText": "AHAHAHAHAHAHHA"
  },
  {
    "commentText": "AHAHAHAHAHA"
  },
  {
    "commentText": "Hello Zooniversity! I love Teddy; he's obviously so adorable but my question is.... do ALL porcupines make these kinds of noises or is it just Teddy? I'm very curious. If not, how is Teddy able to do this? Was he taught? Raised from birth by you, etc? Thank you very much!"
  },
  {
    "commentText": "1:25 It sounds like he's saying \"This is good!\""
  },
  {
    "commentText": "AIIIIIII SO CUTE"
  },
  {
    "commentText": "This has to be the cutest thing EVER!!!!!! I love him."
  },
  {
    "commentText": "I would've just ripped out one of my quills and stabbed a bitch."
  },
  {
    "commentText": "2:27 - The porcupine said \"GET BACK!\""
  },
  {
    "commentText": "The noises he make are soooo cute!!!"
  },
  {
    "commentText": "cutest think i've ever seen"
  },
  {
    "commentText": "Why do I not have one yet?"
  },
  {
    "commentText": "This is so cute.."
  },
  {
    "commentText": "and now I want a porcupine LOL"
  },
  {
    "commentText": "So...we're domesticating porcupines now..?"
  },
  {
    "commentText": "cute :D i <3 this"
  },
  {
    "commentText": "Swear he was just telling her to bugger off the whoollleee time."
  },
  {
    "commentText": "TOO CUTE!  I do believe you must have gotten a bit to close at the end.  :-)"
  },
  {
    "commentText": "i swear at times i could make out words!"
  },
  {
    "commentText": "awwwwwwwwww es muy tiernooooooooo!!!"
  },
  {
    "commentText": "HOW DOES IT MAKE CUTE NOISES WHILE EATING, ARE THEY EVEN REAL"
  },
  {
    "commentText": "OMG that is so precious!! I never realized porcupines could vocalize like that!!!"
  },
  {
    "commentText": "min 1:25, I heard a wtf!!"
  },
  {
    "commentText": "HE EVEN ANSWERS HER OH MY GOD"
  },
  {
    "commentText": "oh my cuteness"
  },
  {
    "commentText": "Против Путина!"
  },
  {
    "commentText": "I FEEL VERY STRONGLY ABOUT THIS PORCUPINE.\nI CANNOT BELIEVE THE AMOUNT OF AFFECTION I'M FEELING.\nOH MY GOD."
  },
  {
    "commentText": "Sounds like gizmo from gremlins movie lol"
  },
  {
    "commentText": "The though of putting a costume on a porcupine fills me with glee and terror, all at the same time. Perfect for Halloween!"
  },
  {
    "commentText": "love the squeaks of pleasure!"
  },
  {
    "commentText": "This is literally the cutest Halloween related thing ever (which is saying a LOT). Where exactly can I get a pet porcupine?"
  },
  {
    "commentText": "I swear he's cussing you out..."
  },
  {
    "commentText": "2:02 \"get outta the way\""
  },
  {
    "commentText": "WHAT DOES THE PORCUPINE SAY!? ...that and it flipping adorable! And his name is teddy!?! Internet I'm done."
  },
  {
    "commentText": "He sounds soooooooo cute Mwhahahahahahahabaaaa"
  },
  {
    "commentText": "I'M LAUGHING SO HARD OMFG"
  },
  {
    "commentText": "0:18\n\"It tastes good\"\n\nhahahah awww. :D"
  },
  {
    "commentText": "I just wanna cuddle this little guy, but that would probably end poorly. XD"
  },
  {
    "commentText": "It's like English, but it just isn't."
  },
  {
    "commentText": "I had to punch a wall to feel manly again."
  },
  {
    "commentText": "hE SOUNDS LIKE RUFUS FROM KIM POSSIBLE"
  },
  {
    "commentText": "it's so smart! responds to her every time she asks a question"
  },
  {
    "commentText": "He talk to mouch"
  },
  {
    "commentText": "Goddamnitross"
  },
  {
    "commentText": "Does teddy ever \"talk\" when he's not eating?"
  },
  {
    "commentText": "He's so happy, now I'm happy"
  },
  {
    "commentText": "THIS IS SO CUTE OH MY GOD"
  },
  {
    "commentText": "Sounds like japanese porn"
  },
  {
    "commentText": "yes."
  },
  {
    "commentText": "ARE PORCUPINES EVEN REAL"
  },
  {
    "commentText": "aw"
  },
  {
    "commentText": "Adorable!!!!!!"
  },
  {
    "commentText": "It's like an adorable little ewok."
  },
  {
    "commentText": "I was not aware of the sound porcupine's make ... until now."
  },
  {
    "commentText": "how do I get one?"
  },
  {
    "commentText": "I LOVE THIS PORCUPINE"
  },
  {
    "commentText": "This is SO ADORABLE"
  },
  {
    "commentText": "God dadmit ross!"
  },
  {
    "commentText": "I just fell in love with a Porcupine for crying out loud!"
  },
  {
    "commentText": "What does the porcupine say?"
  },
  {
    "commentText": "I can't stand the cuteness! I want one!"
  },
  {
    "commentText": "Oh, that is creepy!"
  },
  {
    "commentText": "❤ ☆ ☂ ❤ ☆ ☂  My college drop out brother   is making $86 just working for 2 hrs in both shifts daily  on their computer at home. He was fired from his job  before  8 months but last month his income was $21869 just working on the internet . He CONVINCED me to TRY ATLEAST. Believe me its trusted Extra Earning Source. Know what to do ••••••►►►►►►► BAM80.COM◄◄•••\n♎☀ ♎☀ ♎☀ ♎You win a few, you lose a few. Some get rained out. But you got to dress for all of them."
  },
  {
    "commentText": "It sounds like a pokemon."
  },
  {
    "commentText": "I never realized porcupines could be so FREAKING ADORABLE. O_o"
  },
  {
    "commentText": "i legitimately teared upand i dont know why oh my god"
  },
  {
    "commentText": "It sounds like cousin It. <3"
  },
  {
    "commentText": "0:14 Is that what a porcupine sounds like?!"
  },
  {
    "commentText": "Where can I get one?"
  },
  {
    "commentText": "Porcupines are like dogs you can't hug. ._."
  },
  {
    "commentText": "cousin it?!"
  },
  {
    "commentText": "2:05\nIT SAYS GOOD."
  },
  {
    "commentText": "It sounds like pikachu oh my heart:'''D"
  },
  {
    "commentText": "น่ารัก จุงเบย"
  },
  {
    "commentText": "WHERE DO THESE PEOPLE GET ALL THESE COOL PETS"
  },
  {
    "commentText": "OMG! I had no idea they made sounds like that! Awesome!"
  },
  {
    "commentText": "oH MY JESUS IT'S SPEAKING"
  },
  {
    "commentText": "ARE YOU KIDDING, HE TOTALLY TRIED. A++ FOR EFFORT."
  },
  {
    "commentText": "IT'S SPEAKING TO ME."
  },
  {
    "commentText": "He sounds like cousin IT from Adams Family"
  },
  {
    "commentText": "That's it. That is exactly what that sounds like."
  },
  {
    "commentText": "I'M PRETTY SURE IT SAYS \"QUACK\" SOMETIMES"
  },
  {
    "commentText": "ANYONE ELSE TERRIFIED OF THIS THING?"
  },
  {
    "commentText": "\"Can you say pumpkin?\" \n\nObviously not, it's a porcupine, idiot."
  },
  {
    "commentText": "Oh what a cutie~! I waaaant him!"
  },
  {
    "commentText": "<3 lovelyyyyy"
  },
  {
    "commentText": "Must be related to cousin IT of the Addams family."
  },
  {
    "commentText": "Teddy is so cute.  :-)"
  },
  {
    "commentText": "A-D-O-R-I-B-L-E!!!!!!!"
  },
  {
    "commentText": "I wanna give it kisses NOWWWWW!!"
  },
  {
    "commentText": "I had no idea porcupines sounded like this"
  },
  {
    "commentText": "i wish i could hug him"
  },
  {
    "commentText": "GAWD HE'S ADORABLE"
  },
  {
    "commentText": "OHMYGOOOOOOOOOD IT'S SO CUUUUUUUUUTE."
  },
  {
    "commentText": "i didn't think porcupine's my sounds or were cute until now"
  },
  {
    "commentText": "Jesus fucking christ, why is he so cute? Omg. I can't handle it, this is just the cutest thing ever. Ajsbdjskdb"
  },
  {
    "commentText": "Veruca, darling, you ate before you came to the factory! O:)"
  },
  {
    "commentText": "this is too cute"
  },
  {
    "commentText": "1:25\n\"What the fuck\""
  },
  {
    "commentText": "Any lyrics?"
  },
  {
    "commentText": "!lol at 2:10"
  },
  {
    "commentText": "Ridiculously Cute!"
  },
  {
    "commentText": "It sounds like an Animal Crossing character, it's so cute"
  },
  {
    "commentText": "Can you actually pet this thing? Does it trust you enough to not prick you every time you touch it?"
  },
  {
    "commentText": "And when I make noises like this when I'm eating, no one thinks it's cute. Maybe I should should stop waxing?"
  },
  {
    "commentText": "But, Daddy, I WANT a Teddy the porcupine. I want a Teddy the porcupine NOW!"
  },
  {
    "commentText": "You can have a Porcupine as a pet? o.0 I guess it would make a great \"Guard Dog\" with those quills"
  },
  {
    "commentText": "sounds like Itt from the addams family"
  },
  {
    "commentText": "Thats cute"
  },
  {
    "commentText": "It is The Cheat omg!"
  },
  {
    "commentText": "I just don't understand what about this could make 17 people give it a thumbs down"
  },
  {
    "commentText": "This lady is like the crazy cat lady of the porcupine world. She's having a full conversation with this squeaky little guy!"
  },
  {
    "commentText": "@Killumanited i have no idea where the presumption that i'm gay came from? but also i'd love to prove to you the several instances where'd you be wrong but this is neither the time nor place, just watch the porcupine eat a pumpkin"
  },
  {
    "commentText": "HE's so cute!!!Wow,is he loving the pumpkin!!!"
  },
  {
    "commentText": "WHAT DOES THE PORCUPINE SAY.\narf. arf."
  },
  {
    "commentText": "Oh my god he makes such cute noises!! at one point i heard \"such fun!\""
  },
  {
    "commentText": "its good ! it's good ! its very good ! good good very good. its very. very very very good !! its good ! very very good very. very very very. very very very very"
  },
  {
    "commentText": "OH MY GOD IT IS THE CHEAT"
  },
  {
    "commentText": "THE MOST PRECIOUS NOISES, OH MY GOD"
  },
  {
    "commentText": "awwwww"
  },
  {
    "commentText": "THIS THING IS LITERALLY THE CHEAT"
  },
  {
    "commentText": "Even better at double-speed.\nI don't recommend half-speed."
  },
  {
    "commentText": "Super Super süß......."
  },
  {
    "commentText": "I NEED IT"
  },
  {
    "commentText": "that was so incredibly adorable!"
  },
  {
    "commentText": "if you rub them front to back then you wont get hurt by the spines, although this also can happen if they feel threatened"
  },
  {
    "commentText": "No we just knew you were making a stupid and uneducated comment. Like the idiots who think cats can be forced to eat vegan or that sheep are killed for their wool."
  },
  {
    "commentText": "Porcupines cannot eat pumpkins their stomachs do not create enough acid to break down the pumpkin particles and digest it this porcupine is probably dead by now i made this all up but you did get scared"
  },
  {
    "commentText": "Eeeeeeeee!!!!"
  },
  {
    "commentText": "No, they really don't."
  },
  {
    "commentText": "oh Gawd <3 SQUEEEEE <3 <3 <3 <3"
  },
  {
    "commentText": "Awww so adorable"
  },
  {
    "commentText": "Why so cute. How?!"
  },
  {
    "commentText": "pokemon!"
  },
  {
    "commentText": "Porky Nibbler"
  },
  {
    "commentText": "The last \"Good boy\" and his reply just killed me - you go, Teddy!"
  },
  {
    "commentText": "They do shoot their quils.. I've seen it happen"
  },
  {
    "commentText": "sounds like nibler"
  },
  {
    "commentText": "IT SOUNDS LIKE ITS SPEAKING OUT OF A KAZOO.\nTHIS MAKES ME VERY VERY HAPPY."
  },
  {
    "commentText": "he sounds like a kid"
  },
  {
    "commentText": "ikr, he'll unintentionally hurt her"
  },
  {
    "commentText": "Just so everyone knows those hairs on Teddy are guard hairs, beneith is a layer of nearly 40000 quills that are like sharp shallow hairs, while he looks soft the only place that is soft and safe to touch a new world porcupine is the stomach and his nose where there is no quills.  They also don't shoot their quills but they are able to brush against you and if stressed or scared will release them into skin"
  },
  {
    "commentText": "I work with porcupines lol these are nor.al noises and in no way fake."
  },
  {
    "commentText": "I don't know a lot about poetry SPS, but I do know \"slant rhyme\" means an approximate rhyme, or half rhyme. \"Food\" and \"good\" are precise rhyming words. :-)"
  },
  {
    "commentText": "I feel bad that an animal as cute as Teddy can never curl up in bed and get the cuddle time he deserves"
  },
  {
    "commentText": "guys this so fake omg"
  },
  {
    "commentText": "*porcupine"
  },
  {
    "commentText": "I... Want..... A.... PORCIPINE"
  },
  {
    "commentText": "also they are not soft in any way, its like petting barbed wire"
  },
  {
    "commentText": "Ooo.. So that's how a porcupine sounds like..."
  },
  {
    "commentText": "Omg he either said \"nomnomnom\" or \"fun fun!\""
  },
  {
    "commentText": "It sounds like somthing out of Banjo-Kazooie."
  },
  {
    "commentText": "wait, so... porcupines can speak?\nwhoa. I learned something very important today. thanks for this amazing gift."
  },
  {
    "commentText": "It might just be the quills that can pierce skin pretty easily"
  },
  {
    "commentText": "I love Teddy Bear videos. Thank you for sharing Teddy with the rest of us."
  },
  {
    "commentText": "My whole life up until this point, I thought that porcupines had spikes like echidnas... I'm confused"
  },
  {
    "commentText": "Awwwwww"
  },
  {
    "commentText": "I swear to god it responded \"I like it\""
  },
  {
    "commentText": "Love this animal"
  },
  {
    "commentText": "Teddy is fucking cute."
  },
  {
    "commentText": "oh my god that is so CUTE"
  },
  {
    "commentText": "I WANT A PORCUPINE!!"
  },
  {
    "commentText": "Sounds like Thing but much cuter."
  },
  {
    "commentText": "How to properly put away your decorations after Halloween"
  },
  {
    "commentText": "That's adorable!!! Everyone says that porcupines, hedgehogs, and echidnas are spikey, but he looks like he's just got whisker-like pines. Is he soft? Does he like being petted? x3"
  },
  {
    "commentText": "IF THIS VIDEO STILL EXISTS BY THE TIME I PROCREATE I WILL SHOW THIS TO MY CHILDREN"
  },
  {
    "commentText": "I'm not sure which porcupine is cuter--Teddy or Kemo Sabe..."
  },
  {
    "commentText": "at 1:16 he says pumpkin!"
  },
  {
    "commentText": "So cute. Omg. Thankyou for showing everyone the cute side of porkupines"
  },
  {
    "commentText": "Totally awesome"
  },
  {
    "commentText": "It's sooooooo cute!! I never what sound they made lol"
  },
  {
    "commentText": "Now I know where Cousin Itt's voice came from!"
  },
  {
    "commentText": "He responds to your voice :3 how adorable\nI never knew they could be friendly ^-^\nhave you had him from birth?"
  },
  {
    "commentText": "He can talk..."
  },
  {
    "commentText": "he really did say \"pumpkin\" and \"I like it\". Oh my god."
  },
  {
    "commentText": "OH MY GOD I NEVER KNEW PORCUPINES MADE SUCH CUTE NOISES"
  },
  {
    "commentText": "we may never know what the fox says, but at least we know what the porcupine says."
  },
  {
    "commentText": "no, you can touch them and even pet them without getting barbed.  if you ever surprise them from behind, or touch them when they don't want, then ow.  also always touch with the grain, never against"
  },
  {
    "commentText": "Porcupines are suprisingly decent animals to keep as a pet (if you know what the fuck you are doing that is), I mean out of all the large exotic animals you could keep, this is probably one of the better ones"
  },
  {
    "commentText": "sooo cuteeee! x3 \naww :3"
  },
  {
    "commentText": "Its just its natural voice ya know?"
  },
  {
    "commentText": "The real treat is this video"
  },
  {
    "commentText": "C'mon, man. Don't be that guy."
  },
  {
    "commentText": "im pretty sure in the porcupine language hes just saying \"fuck you\" over and over."
  },
  {
    "commentText": "This woman is an idiot. It doesn't speak English. Pick it up, good boy. Derrp"
  },
  {
    "commentText": "Oh my gosh! I never knew porcupines could make noises like that! I'm in love! I want one"
  },
  {
    "commentText": "you win, have some internet points for the day, good sir! :) XD"
  },
  {
    "commentText": "OMG.im dead too cute !"
  },
  {
    "commentText": "never knew porcupine can get that noisy till this day..."
  },
  {
    "commentText": "Who is the voice for Teddy?"
  },
  {
    "commentText": "SO cute :)"
  },
  {
    "commentText": "OMG it's so cute!!!!"
  },
  {
    "commentText": "Sounds like a minion. I want one."
  },
  {
    "commentText": "I feel like it understands."
  },
  {
    "commentText": "So cute!"
  },
  {
    "commentText": "It's all fun and games until it goes mental and starts stabbing everything it can reach for no reason whatso ever"
  },
  {
    "commentText": "Who is making the cute noises?"
  },
  {
    "commentText": "This is so cool.  I'm amazed."
  },
  {
    "commentText": "I don't understand why I've gone nearly 29 years without knowing the insane cuteness of porcupines."
  },
  {
    "commentText": "\"I dare you to touch me.. just ....touch me\""
  },
  {
    "commentText": "He sounds a little like Cousin Itt....."
  },
  {
    "commentText": "2:23 \"What do you think Teddy, is that as good as pumpkin pie?\n2:27 \"FUCK THAT"
  },
  {
    "commentText": "I cannot believe how adorable this is."
  },
  {
    "commentText": "Don't feed the parasprites"
  },
  {
    "commentText": "Furries are human garbage"
  },
  {
    "commentText": "Had to punch a wall to feel like a man again."
  },
  {
    "commentText": "Dude what even wrong with you why are you so pissed lol?"
  },
  {
    "commentText": "Yum yum ?.? Oh yeah lol"
  },
  {
    "commentText": "The twist?  She owns a helium production plant..."
  },
  {
    "commentText": "OH MY GOD SO CUTE  :33333 <3"
  },
  {
    "commentText": "Oh. My. God. The noises it made....oh my god...."
  },
  {
    "commentText": "Adorable"
  },
  {
    "commentText": "lol everyone look at the furry try to defend his sick habits"
  },
  {
    "commentText": "At 0:53 it actually says pumpkin lol"
  },
  {
    "commentText": "He is chowing down on that pumpkin"
  },
  {
    "commentText": "I laughed out loud. Thank you. I know what you mean"
  },
  {
    "commentText": "Are you sure his chat is happy?  I'm sure he would be a lot quieter if she backed up."
  },
  {
    "commentText": "SO CUTE! But how do you pet or handle him?"
  },
  {
    "commentText": "Wow, you're right. You explained so much. I'm sorry, I should listen to the person who has a generic icon and a fan of LoL and 4chan, and brilliant musical compositions such as \"Do Your Chain Hang Low\" and \"Bong Hits\". You're clearly the pinnacle of intelligence. No wait, oops, you're human garbage."
  },
  {
    "commentText": "I really needed this after watching 12 Years a Slave"
  },
  {
    "commentText": "permission to freak out, sir"
  },
  {
    "commentText": "kill it"
  },
  {
    "commentText": "0.55   'I like it, I like it, I like it!'"
  },
  {
    "commentText": "Real life Animal Crossing"
  },
  {
    "commentText": "\"Oh my fucking god this is so good\" - Teddy 2013"
  },
  {
    "commentText": "LOL with a furry avatar, A+"
  },
  {
    "commentText": "So cute"
  },
  {
    "commentText": "Are you fucking autistic?"
  },
  {
    "commentText": "I didn't know they were so vocal... that is like baby babbling, like he's mimicking the word 'pumpkin'. Amazing."
  },
  {
    "commentText": "Who knew Cousin Itt liked pumpkins so much?"
  },
  {
    "commentText": "aww"
  },
  {
    "commentText": "Rhyming food with good?  Come on.  You can do better than slant rhyme."
  },
  {
    "commentText": "Go ahead. Pet it. Pet it."
  },
  {
    "commentText": "OK i'm dying this is, too frwejlkning CUTE!"
  },
  {
    "commentText": "Probably one of the cutest things I've ever seen in my life!!! Thanks for posting!"
  },
  {
    "commentText": "Where are his quills?"
  },
  {
    "commentText": "ending: \"Good boy, Teddy\" Ted: \"Thanks!\" haha"
  },
  {
    "commentText": "So... Will It Blend?"
  },
  {
    "commentText": "Alright internet, you win, you win. My cold black soul will come quietly with its hands up."
  },
  {
    "commentText": "It must be frustrating to be a porcupine. He must be yelling \"BACK the hell away, friend. I don't want to hurt you\", but it just comes out in squeaks."
  },
  {
    "commentText": "its sounds so horrible"
  },
  {
    "commentText": "Snooki wants smoosh smoosh!!"
  },
  {
    "commentText": "Hello there. We have sent a message to your YouTube inbox. It would be great if you could take a look at it and get back to us as soon as possible or email us at curator@storyful.com. Kind regards, Derek Bowler"
  },
  {
    "commentText": "He sounds like a Jawa."
  },
  {
    "commentText": "Teddy bear..... I just love you!!! Hope you enjoyed your yummy pumpkins!!"
  },
  {
    "commentText": "Teddy!... There are no words to fully describe your awesomeness <3"
  },
  {
    "commentText": "At 0:19, I heard \"Pumpkins, good.\""
  },
  {
    "commentText": "I just love you, Teddy Bear!"
  },
  {
    "commentText": "more videos with subtitles please!"
  },
  {
    "commentText": "So Sweet :)"
  },
  {
    "commentText": "LOL, every time the camera gets in close...\"Back off!\""
  },
  {
    "commentText": "I love watching Teddy eat! Thank you so much for these videos!"
  },
  {
    "commentText": "I think some of this, e.g. 1:15, is \"You're getting too close to my pumpkin!\"\n\nHe seems more fluffy than spiny. Are the spines somewhere else on him out of shot?"
  },
  {
    "commentText": "Sweet Teddy Bear, we do so love to watch you eat your food.\nWe love to hear your happy chat and how you think it's \"Good!\"\nIt's such a joy to watch you eat your pumpkins and your corn\nThe moment that we heard your voice we knew a star was born."
  }
]